{
    "0_query_id": "q9zjh7Uw7Q",
    "0_label": "No",
    "0_query_text": "Viewers under 16 years old can watch movies with content classified as T18",
    "0_relevant_article_0_law_id": "Cinema Law 2022",
    "0_relevant_article_0_article_id": "32",
    "0_relevant_article_0_article_text_title": "Movie classification",
    "0_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "0_relevant_article_0_article_text_clauses_0_clause": "",
    "0_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "0_relevant_article_0_article_text_clauses_1_clause": "Movies are classified according to content for distribution appropriate to the age of viewers or are not allowed to be disseminated as follows:",
    "0_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Category P: Movies are allowed to be popular with viewers of all ages;",
    "0_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Type T18 (18+): Films are popular with viewers aged 18 and over;",
    "0_relevant_article_0_article_text_clauses_1_sub_clauses_2": "Category T16 (16+): Movies are popular with viewers aged 16 and over:",
    "0_relevant_article_0_article_text_clauses_1_sub_clauses_3": "Category T13 (13+): Movies are popular with viewers aged 13 and over;",
    "0_relevant_article_0_article_text_clauses_1_sub_clauses_4": "Category K: Films intended for viewing by viewers under 13 years of age with the condition of being viewed with a parent or guardian;",
    "0_relevant_article_0_article_text_clauses_1_sub_clauses_5": "Category C: Films not allowed to be distributed.",
    "0_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "0_relevant_article_0_article_text_clauses_2_clause": "Film classification criteria applicable to all forms of film dissemination are prescribed by the Minister of Culture, Sports and Tourism.",
    "1_query_id": "ckQFn8y202",
    "1_label": "No",
    "1_query_text": "Within 03 working days from the date a drug addict uses the service or voluntarily stops using the service or completes the service, he or she must notify the commune-level People's Committee where that person registered for treatment. Voluntary drug addiction at home and in the community.",
    "1_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "1_relevant_article_0_article_id": "30",
    "1_relevant_article_0_article_text_title": "Voluntary drug detoxification at home and in the community",
    "1_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "1_relevant_article_0_article_text_clauses_0_clause": "",
    "1_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "1_relevant_article_0_article_text_clauses_1_clause": "Voluntary drug detoxification at home and in the community means drug addicts perform voluntary detoxification at home or in the community with the professional support of organizations and individuals providing drug detoxification services. , with the coordination and support of family and community and under the management of the commune-level People's Committee.",
    "1_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "1_relevant_article_0_article_text_clauses_2_clause": "The duration of voluntary drug addiction treatment at home and in the community is from 6 months to 12 months.",
    "1_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "1_relevant_article_0_article_text_clauses_3_clause": "Drug addicts who voluntarily undergo drug rehabilitation at home or in the community upon completing at least 03 stages specified in points a, b and c, Clause 1, Article 29 of this Law shall receive financial support.",
    "1_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "1_relevant_article_0_article_text_clauses_4_clause": "People who voluntarily detoxify from drugs at home or in the community have the following responsibilities:",
    "1_relevant_article_0_article_text_clauses_4_sub_clauses_0": "Correctly and fully comply with regulations on voluntary drug detoxification and comply with instructions from specialized agencies;",
    "1_relevant_article_0_article_text_clauses_4_sub_clauses_1": "Pay costs related to drug addiction treatment according to regulations.",
    "1_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "1_relevant_article_0_article_text_clauses_5_clause": "The Chairman of the Commune People's Committee has the following responsibilities:",
    "1_relevant_article_0_article_text_clauses_5_sub_clauses_0": "Receive registration for voluntary drug addiction treatment at home and community;",
    "1_relevant_article_0_article_text_clauses_5_sub_clauses_1": "Guide and manage voluntary drug addicts at home and in the community;",
    "1_relevant_article_0_article_text_clauses_5_sub_clauses_2": "Issue a certificate of completion of voluntary drug detoxification at home and in the community.",
    "1_relevant_article_0_article_text_clauses_6_clause_id": "6",
    "1_relevant_article_0_article_text_clauses_6_clause": "The Chairman of the District People's Committee has the following responsibilities:",
    "1_relevant_article_0_article_text_clauses_6_sub_clauses_0": "Assign tasks to public service units under local authority to provide voluntary drug addiction treatment services at home and in the community;",
    "1_relevant_article_0_article_text_clauses_6_sub_clauses_1": "Receive registration and announce the list of organizations and individuals qualified to provide voluntary drug detoxification services at home and in the community;",
    "1_relevant_article_0_article_text_clauses_6_sub_clauses_2": "Notify the Commune People's Committee of the list of organizations and individuals providing voluntary drug detoxification services at home and in the community;",
    "1_relevant_article_0_article_text_clauses_6_sub_clauses_3": "Arrange funding to support voluntary drug addiction treatment at home and in the community;",
    "1_relevant_article_0_article_text_clauses_6_sub_clauses_4": "Direct, guide and inspect voluntary drug addiction treatment at home and in the community.",
    "1_relevant_article_0_article_text_clauses_7_clause_id": "7",
    "1_relevant_article_0_article_text_clauses_7_clause": "Drug rehabilitation facilities, organizations and individuals that are qualified to provide one or more rehabilitation activities according to the drug rehabilitation process prescribed in Clause 1, Article 29 of this Law are allowed to provide voluntary drug rehabilitation services at home and in the community and have the following responsibilities:",
    "1_relevant_article_0_article_text_clauses_7_sub_clauses_0": "Receive and organize the provision of voluntary drug detoxification services at home and in the community;",
    "1_relevant_article_0_article_text_clauses_7_sub_clauses_1": "Comply with professional procedures according to regulations of competent authorities;",
    "1_relevant_article_0_article_text_clauses_7_sub_clauses_2": "Within 05 working days from the date a drug addict uses the service or voluntarily stops using the service or completes the service, he or she must notify the People's Committee of the commune where he or she registered for treatment. Voluntary drug addiction at home and in the community.",
    "1_relevant_article_0_article_text_clauses_8_clause_id": "8",
    "1_relevant_article_0_article_text_clauses_8_clause": "Eligible organizations and individuals may register to provide voluntary drug detoxification services at home and in the community with the Chairman of the District People's Committee.",
    "1_relevant_article_0_article_text_clauses_9_clause_id": "9",
    "1_relevant_article_0_article_text_clauses_9_clause": "The Government shall detail this Article.",
    "2_query_id": "3ROu621ZEO",
    "2_label": "Yes",
    "2_query_text": "The officer has been classified for 02 consecutive years at the level of failing to complete his/her duties",
    "2_relevant_article_0_law_id": "Law on Civil Servants 2010",
    "2_relevant_article_0_article_id": "29",
    "2_relevant_article_0_article_text_title": "Unilateral termination of employment contract",
    "2_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "2_relevant_article_0_article_text_clauses_0_clause": "",
    "2_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "2_relevant_article_0_article_text_clauses_1_clause": "Public service units may unilaterally terminate working contracts with public employees in the following cases:",
    "2_relevant_article_0_article_text_clauses_1_sub_clauses_0": "The officer has been classified for 02 consecutive years at the level of failing to complete his/her duties;",
    "2_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Officials are forced to quit their jobs according to the provisions of Point d, Clause 1, Article 52 and Clause 1, Article 57 of this Law;",
    "2_relevant_article_0_article_text_clauses_1_sub_clauses_2": "An employee working under an indefinite-term working contract is sick and has been treated for 12 consecutive months, and an employee working under a fixed-term working contract is sick and has been treated for 6 consecutive months for which he or she can be treated. Working ability has not recovered. When the employee's health recovers, he/she will be considered to continue signing a working contract;",
    "2_relevant_article_0_article_text_clauses_1_sub_clauses_3": "Due to natural disasters, fires or other force majeure reasons according to Government regulations, public service units are forced to downsize, causing the job position that the employee is holding to no longer exist;",
    "2_relevant_article_0_article_text_clauses_1_sub_clauses_4": "When a public service unit terminates its operations according to a decision of a competent authority.",
    "2_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "2_relevant_article_0_article_text_clauses_2_clause": "When unilaterally terminating a working contract, except for the case specified in Point b, Clause 1 of this Article, the head of a public service unit must notify the public employee at least 45 days in advance for an inconsistent working contract. fixed term or at least 30 days for fixed term employment contracts. For public employees recruited by the management agency of a public service unit, unilateral termination of the working contract is decided by the head of the public service unit after obtaining written consent. of the public service unit management agency.",
    "2_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "2_relevant_article_0_article_text_clauses_3_clause": "The head of a public service unit is not allowed to unilaterally terminate the working contract with a public employee in the following cases:",
    "2_relevant_article_0_article_text_clauses_3_sub_clauses_0": "The employee is sick or has an accident or is being treated for an occupational disease according to the decision of the medical facility, except for the case specified in Point c, Clause 1 of this Article;",
    "2_relevant_article_0_article_text_clauses_3_sub_clauses_1": "Officials are on annual leave, personal leave and other leave cases permitted by the head of the public service unit;",
    "2_relevant_article_0_article_text_clauses_3_sub_clauses_2": "Female public employees who are pregnant, on maternity leave, or raising children under 36 months old, except in cases where the public service unit terminates operations.",
    "2_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "2_relevant_article_0_article_text_clauses_4_clause": "Public employees working under an indefinite term contract have the right to unilaterally terminate the contract but must notify the head of the public service unit in writing at least 45 days in advance; In case an officer is sick or has an accident and has been treated for 6 consecutive months, he/she must give notice at least 3 days in advance.",
    "2_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "2_relevant_article_0_article_text_clauses_5_clause": "Public employees working under a fixed-term employment contract have the right to unilaterally terminate the contract in the following cases:",
    "2_relevant_article_0_article_text_clauses_5_sub_clauses_0": "Not being assigned to the correct job position, work location or not ensuring the working conditions agreed upon in the work contract;",
    "2_relevant_article_0_article_text_clauses_5_sub_clauses_1": "Not being paid in full or not being paid on time according to the work contract;",
    "2_relevant_article_0_article_text_clauses_5_sub_clauses_2": "Treated badly; forced labor;",
    "2_relevant_article_0_article_text_clauses_5_sub_clauses_3": "You or your family are truly in difficult circumstances and cannot continue to perform the contract;",
    "2_relevant_article_0_article_text_clauses_5_sub_clauses_4": "Pregnant female officials must take leave from work as directed by the medical facility;",
    "2_relevant_article_0_article_text_clauses_5_sub_clauses_5": "The employee has been sick or had an accident and has been treated for 3 consecutive months but his ability to work has not recovered.",
    "2_relevant_article_0_article_text_clauses_6_clause_id": "6",
    "2_relevant_article_0_article_text_clauses_6_clause": "The civil servant must notify in writing the head of the public service unit of the unilateral termination of the employment contract at least 03 days in advance in the cases specified in Points a, b, c, d and e, Clause 5 of this Article; at least 30 days in advance in the case specified in Point d, Clause 5 of this Article.",
    "3_query_id": "VT1QuVmhCc",
    "3_label": "Yes",
    "3_query_text": "What are the following measures for drug addiction treatment? Answer: Voluntary drug addiction treatment and Compulsory drug addiction treatment",
    "3_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "3_relevant_article_0_article_id": "28",
    "3_relevant_article_0_article_text_title": "Drug addiction treatment measures",
    "3_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "3_relevant_article_0_article_text_clauses_0_clause": "",
    "3_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "3_relevant_article_0_article_text_clauses_1_clause": "Drug addiction treatment measures include:",
    "3_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Voluntary drug detoxification;",
    "3_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Compulsory drug detoxification.",
    "3_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "3_relevant_article_0_article_text_clauses_2_clause": "Voluntary drug detoxification measures are carried out at home, in the community or at drug detoxification facilities; Compulsory drug detoxification measures are carried out at public drug detoxification facilities.",
    "4_query_id": "0MwITLtbmg",
    "4_label": "No",
    "4_query_text": "Officials of a public service unit are not currently allowed to participate in service contracts with other units, agencies or organizations.",
    "4_relevant_article_0_law_id": "Law on Public Employees 2010",
    "4_relevant_article_0_article_id": "14",
    "4_relevant_article_0_article_text_title": "Rights of public employees to conduct business and work outside of prescribed hours",
    "4_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "4_relevant_article_0_article_text_clauses_0_clause": "",
    "4_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "4_relevant_article_0_article_text_clauses_1_clause": "To carry out professional activities outside the working hours specified in the working contract, unless otherwise prescribed by law.",
    "4_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "4_relevant_article_0_article_text_clauses_2_clause": "To sign service contracts with other agencies, organizations or units that are not prohibited by law but must complete assigned tasks and have the consent of the head of the public service unit.",
    "4_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "4_relevant_article_0_article_text_clauses_3_clause": "Contribute capital but do not participate in the management and operation of limited liability companies, joint stock companies, partnerships, cooperatives, private hospitals, private schools and private scientific research organizations, except In cases where specialized laws have different provisions.",
    "5_query_id": "iWBRVGwBcb",
    "5_label": "No",
    "5_query_text": "People from 14 years old to under 18 years old who are undergoing compulsory drug rehabilitation are found to have committed a crime before or during the time of serving the decision on compulsory drug rehabilitation and are sentenced to imprisonment by the Court but not If the person receives a suspended sentence, he or she will not be exempted from serving the remaining time specified in the decision to send him or her to a compulsory drug treatment facility.",
    "5_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "5_relevant_article_0_article_id": "39",
    "5_relevant_article_0_article_text_title": "Exemption from serving the remaining time in the decision to send to a compulsory drug detoxification facility for people from 14 years old to under 18 years old who are undergoing compulsory drug addiction treatment.",
    "5_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "5_relevant_article_0_article_text_clauses_0_clause": "",
    "5_relevant_article_0_article_text_clauses_0_sub_clauses_0": "People from 14 years old to under 18 years old who are undergoing compulsory drug rehabilitation are found to have committed a crime before or during the time of serving the decision on compulsory drug rehabilitation and are sentenced to imprisonment by the Court but not If the person receives a suspended sentence, they will be exempted from serving the remaining time specified in the decision to send them to a mandatory drug treatment facility.",
    "6_query_id": "XsfBrLUkvw",
    "6_label": "No",
    "6_query_text": "What is the responsibility of the Ministry of Health in drug prevention and combat? Answer: Organize the assessment of narcotics and precursors",
    "6_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "6_relevant_article_0_article_id": "49",
    "6_relevant_article_0_article_text_title": "Responsibilities of the Ministry of Health",
    "6_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "6_relevant_article_0_article_text_clauses_0_clause": "",
    "6_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "6_relevant_article_0_article_text_clauses_1_clause": "Promulgate according to authority or submit to competent state agencies to promulgate legal documents on drug prevention and combat.",
    "6_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "6_relevant_article_0_article_text_clauses_2_clause": "Conduct research on drugs and drug addiction treatment methods; issuance and revocation of licenses to circulate drugs and drug addiction treatment methods; Human support and medical technical expertise for drug addiction treatment.",
    "6_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "6_relevant_article_0_article_text_clauses_3_clause": "Statistics on people participating in opiate addiction treatment using alternative medicine.",
    "7_query_id": "bu3nyKAUNT",
    "7_label": "No",
    "7_query_text": "Viewers 18 years of age or older are allowed to watch movies with K-rated content as long as they watch with a parent or guardian.",
    "7_relevant_article_0_law_id": "Cinema Law 2022",
    "7_relevant_article_0_article_id": "32",
    "7_relevant_article_0_article_text_title": "Movie classification",
    "7_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "7_relevant_article_0_article_text_clauses_0_clause": "",
    "7_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "7_relevant_article_0_article_text_clauses_1_clause": "Movies are classified according to content for distribution appropriate to the age of viewers or are not allowed to be disseminated as follows:",
    "7_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Category P: Movies are allowed to be popular with viewers of all ages;",
    "7_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Category T18 (18+): Movies are popular with viewers aged 18 and over;",
    "7_relevant_article_0_article_text_clauses_1_sub_clauses_2": "Category T16 (16+): Movies are popular with viewers aged 16 and over:",
    "7_relevant_article_0_article_text_clauses_1_sub_clauses_3": "Category T13 (13+): Movies are popular with viewers aged 13 and over;",
    "7_relevant_article_0_article_text_clauses_1_sub_clauses_4": "Category K: Films intended for viewing by viewers under 13 years of age with the condition of being viewed with a parent or guardian;",
    "7_relevant_article_0_article_text_clauses_1_sub_clauses_5": "Category C: Films not allowed to be distributed.",
    "7_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "7_relevant_article_0_article_text_clauses_2_clause": "Film classification criteria applicable to all forms of film dissemination are prescribed by the Minister of Culture, Sports and Tourism.",
    "8_query_id": "msHHa3bELB",
    "8_label": "Yes",
    "8_query_text": "Public employees have the right to be trained and fostered to improve their political, professional and professional qualifications",
    "8_relevant_article_0_law_id": "Law on Public Employees 2010",
    "8_relevant_article_0_article_id": "11",
    "8_relevant_article_0_article_text_title": "Rights of public employees regarding professional activities",
    "8_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "8_relevant_article_0_article_text_clauses_0_clause": "",
    "8_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "8_relevant_article_0_article_text_clauses_1_clause": "Protected by law in professional activities.",
    "8_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "8_relevant_article_0_article_text_clauses_2_clause": "Trained and fostered to improve political, professional and professional qualifications.",
    "8_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "8_relevant_article_0_article_text_clauses_3_clause": "Guaranteed equipment, facilities and working conditions.",
    "8_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "8_relevant_article_0_article_text_clauses_4_clause": "Be provided with information related to assigned work or tasks.",
    "8_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "8_relevant_article_0_article_text_clauses_5_clause": "Decide on professional issues related to assigned work or tasks.",
    "8_relevant_article_0_article_text_clauses_6_clause_id": "6",
    "8_relevant_article_0_article_text_clauses_6_clause": "Have the right to refuse to perform work or tasks that are contrary to the provisions of law.",
    "8_relevant_article_0_article_text_clauses_7_clause_id": "7",
    "8_relevant_article_0_article_text_clauses_7_clause": "Enjoy other rights regarding professional activities according to the provisions of law.",
    "9_query_id": "RVV34aoTvI",
    "9_label": "No",
    "9_query_text": "Continuing education institutions include universities or research institutes.",
    "9_relevant_article_0_law_id": "Education Law 2019",
    "9_relevant_article_0_article_id": "44",
    "9_relevant_article_0_article_text_title": "Continuing education facility",
    "9_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "9_relevant_article_0_article_text_clauses_0_clause": "",
    "9_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "9_relevant_article_0_article_text_clauses_1_clause": "Continuing education is carried out at continuing education establishments, general education establishments, vocational education establishments, higher education establishments, cultural establishments, at workplaces, and residential communities. , through mass media and other means.",
    "9_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "9_relevant_article_0_article_text_clauses_2_clause": "Continuing education facilities include:",
    "9_relevant_article_0_article_text_clauses_2_sub_clauses_0": "Continuing education centers;",
    "9_relevant_article_0_article_text_clauses_2_sub_clauses_1": "Vocational education center - continuing education;",
    "9_relevant_article_0_article_text_clauses_2_sub_clauses_2": "Community Learning Center;",
    "9_relevant_article_0_article_text_clauses_2_sub_clauses_3": "Another center carries out continuing education missions.",
    "9_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "9_relevant_article_0_article_text_clauses_3_clause": "The implementation of continuing education programs of continuing education establishments is regulated as follows:",
    "9_relevant_article_0_article_text_clauses_3_sub_clauses_0": "Continuing education centers, vocational education centers - continuing education implement the programs specified in Clause 1, Article 43 of this Law, except for educational programs to obtain intermediate diplomas and advanced diplomas. Associate's degree, bachelor's degree;",
    "9_relevant_article_0_article_text_clauses_3_sub_clauses_1": "Community learning centers implement the programs specified in Points a and b, Clause 1, Article 43 of this Law;",
    "9_relevant_article_0_article_text_clauses_3_sub_clauses_2": "Other centers performing continuing education tasks carry out the programs specified in Points b and c, Clause 1, Article 43 of this Law.",
    "9_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "9_relevant_article_0_article_text_clauses_4_clause": "General education institutions, vocational education institutions, and higher education institutions, when implementing continuing education programs, must ensure their educational and training tasks and only carry out prescribed programs. at Point d, Clause 1, Article 43 of this Law when permitted by the competent state management agency in charge of education.",
    "9_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "9_relevant_article_0_article_text_clauses_5_clause": "Joint training at university level in the form of work and study is carried out in accordance with the provisions of the Law on Higher Education.",
    "10_query_id": "M5lSCyhgJE",
    "10_label": "Yes",
    "10_query_text": "Drug addicts aged 18 years or older are subject to administrative measures of being sent to compulsory detoxification facilities according to the provisions of the Law on Handling of Administrative Violations when discovered to be using narcotics illegally. allowed during a period of voluntary drug rehabilitation.",
    "10_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "10_relevant_article_0_article_id": "32",
    "10_relevant_article_0_article_text_title": "The subject is subject to administrative measures and sent to a mandatory detoxification facility",
    "10_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "10_relevant_article_0_article_text_clauses_0_clause": "",
    "10_relevant_article_0_article_text_clauses_0_sub_clauses_0": "Drug addicts aged 18 years or older are subject to administrative measures of being sent to compulsory detoxification facilities according to the provisions of the Law on Handling of Administrative Violations when they fall into one of the following cases:",
    "10_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "10_relevant_article_0_article_text_clauses_1_clause": "Failure to register, failure to perform or arbitrarily terminating voluntary drug rehabilitation;",
    "10_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "10_relevant_article_0_article_text_clauses_2_clause": "During voluntary drug rehabilitation, he was discovered to be illegally using drugs;",
    "10_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "10_relevant_article_0_article_text_clauses_3_clause": "Opioid drug addicts who do not register, do not perform or arbitrarily terminate treatment for opiate addiction with alternative drugs or have their treatment for opiate addiction with alternative drugs terminated due to violating regulations on addiction treatment;",
    "10_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "10_relevant_article_0_article_text_clauses_4_clause": "During the period of drug addiction treatment, he relapsed.",
    "11_query_id": "XEJo5sXAMr",
    "11_label": "No",
    "11_query_text": "Agencies, organizations, and units managing public employees shall issue retirement decisions for public employees within 06 months from the date of retirement.",
    "11_relevant_article_0_law_id": "Law on Public Employees 2010",
    "11_relevant_article_0_article_id": "46",
    "11_relevant_article_0_article_text_title": "Pension regime",
    "11_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "11_relevant_article_0_article_text_clauses_0_clause": "",
    "11_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "11_relevant_article_0_article_text_clauses_1_clause": "Officials are entitled to retirement benefits according to the provisions of labor law and social insurance law.",
    "11_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "11_relevant_article_0_article_text_clauses_2_clause": "6 months before the employee's retirement date, the agency, organization or unit managing the employee must notify in writing the time of retirement; 3 months before the employee's retirement date, the agency, organization or unit managing the employee shall issue a decision to retire.",
    "11_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "11_relevant_article_0_article_text_clauses_3_clause": "Public service units can sign service contracts with pensioners if the unit has a need and the pensioner wishes; During the contract period, in addition to the contractual remuneration, that person is entitled to a number of specific regimes and policies on management mechanisms to ensure conditions for professional activities prescribed by the Government.",
    "12_query_id": "sqjV9Bb2WH",
    "12_label": "Yes",
    "12_query_text": "The goal of higher education is to train highly qualified human resources, improve people's knowledge and foster talents.",
    "12_relevant_article_0_law_id": "Education Law 2019",
    "12_relevant_article_0_article_id": "39",
    "12_relevant_article_0_article_text_title": "The goal of higher education",
    "12_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "12_relevant_article_0_article_text_clauses_0_clause": "",
    "12_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "12_relevant_article_0_article_text_clauses_1_clause": "Training highly qualified human resources, improving people's knowledge, fostering talents; Scientific and technological research creates new knowledge and products, serving the needs of socio-economic development, ensuring national defense, security, and international integration.",
    "12_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "12_relevant_article_0_article_text_clauses_2_clause": "Training students to develop comprehensively in virtue, mind, body, and beauty; have knowledge, skills, and professional responsibility; Ability to grasp scientific and technological advances commensurate with training level, ability to self-study, be creative, and adapt to the working environment; Have a entrepreneurial spirit and a sense of serving the people.",
    "13_query_id": "ZBC6orkgch",
    "13_label": "No",
    "13_query_text": "How many levels of higher education are there? Answer: 02 levels of higher education training",
    "13_relevant_article_0_law_id": "Education Law 2019",
    "13_relevant_article_0_article_id": "38",
    "13_relevant_article_0_article_text_title": "Levels of higher education training",
    "13_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "13_relevant_article_0_article_text_clauses_0_clause": "",
    "13_relevant_article_0_article_text_clauses_0_sub_clauses_0": "Higher education provides undergraduate, master's and doctoral degrees.",
    "14_query_id": "LQv3sLibDh",
    "14_label": "Yes",
    "14_query_text": "The responsibility of drug users is to comply with the management of state agencies, specifically the People's Committee at commune and ward levels.",
    "14_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "14_relevant_article_0_article_id": "24",
    "14_relevant_article_0_article_text_title": "Responsibilities of illegal drug users",
    "14_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "14_relevant_article_0_article_text_clauses_0_clause": "",
    "14_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "14_relevant_article_0_article_text_clauses_1_clause": "Provide complete and accurate information about your illegal use of drugs to the commune-level police where you reside.",
    "14_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "14_relevant_article_0_article_text_clauses_2_clause": "Comply with the management of the commune-level People's Committee.",
    "15_query_id": "EQqD60Y271",
    "15_label": "Yes",
    "15_query_text": "Educational administrators play an important role in managing, organizing, and operating educational activities.",
    "15_relevant_article_0_law_id": "Education Law 2019",
    "15_relevant_article_0_article_id": "18",
    "15_relevant_article_0_article_text_title": "Roles and responsibilities of educational administrators",
    "15_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "15_relevant_article_0_article_text_clauses_0_clause": "",
    "15_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "15_relevant_article_0_article_text_clauses_1_clause": "Educational administrators play an important role in organizing, managing, and administering educational activities.",
    "15_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "15_relevant_article_0_article_text_clauses_2_clause": "Education managers are responsible for studying, training, improving moral qualities, professional qualifications, management capacity and implementing standards and regulations according to the provisions of law.",
    "15_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "15_relevant_article_0_article_text_clauses_3_clause": "The State has a plan to build and improve the quality of education management staff.",
    "16_query_id": "fjoqioXeO1",
    "16_label": "No",
    "16_query_text": "What is the responsibility of the Ministry of National Defense in drug prevention and combat? Answer: Carry out international cooperation on drug addiction treatment",
    "16_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "16_relevant_article_0_article_id": "48",
    "16_relevant_article_0_article_text_title": "Responsibilities of the Ministry of National Defense",
    "16_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "16_relevant_article_0_article_text_clauses_0_clause": "",
    "16_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "16_relevant_article_0_article_text_clauses_1_clause": "Promulgate according to authority or submit to competent state agencies to promulgate legal documents on drug prevention and combat.",
    "16_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "16_relevant_article_0_article_text_clauses_2_clause": "Organize the implementation of drug prevention and combat plans in land and sea border areas, contiguous zones, exclusive economic zones and continental shelves.",
    "16_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "16_relevant_article_0_article_text_clauses_3_clause": "Direct the Border Guard and Vietnam Coast Guard to preside over and coordinate with relevant agencies, organizations, and functional forces to receive and process information on drug-related crimes, detect, prevent, and combat drug-related law violations, and control legal drug-related activities in the areas and localities specified in Clause 2 of this Article in accordance with the provisions of this Law and other relevant legal provisions.",
    "16_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "16_relevant_article_0_article_text_clauses_4_clause": "Training and fostering people responsible for preventing and combating drug-related crimes of the Vietnam Border Guard and Coast Guard.",
    "16_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "16_relevant_article_0_article_text_clauses_5_clause": "Statistics on drug addicts in prisons, detention camps, and temporary detention houses managed by the Ministry of National Defense.",
    "17_query_id": "40giv2OvF6",
    "17_label": "No",
    "17_query_text": "In what cases is a school dissolved? Answer: Ensuring quality of education.",
    "17_relevant_article_0_law_id": "Education Law 2019",
    "17_relevant_article_0_article_id": "51",
    "17_relevant_article_0_article_text_title": "Merger, division, separation, and dissolution of schools",
    "17_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "17_relevant_article_0_article_text_clauses_0_clause": "",
    "17_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "17_relevant_article_0_article_text_clauses_1_clause": "Schools that merge, divide or separate must ensure the following requirements:",
    "17_relevant_article_0_article_text_clauses_1_sub_clauses_0": "In accordance with the socio-economic development planning and educational facility network planning according to the provisions of the Planning Law;",
    "17_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Meet the needs of socio-economic development;",
    "17_relevant_article_0_article_text_clauses_1_sub_clauses_2": "Ensure the rights and interests of teachers and learners;",
    "17_relevant_article_0_article_text_clauses_1_sub_clauses_3": "Contribute to improving the quality and effectiveness of education.",
    "17_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "17_relevant_article_0_article_text_clauses_2_clause": "The school will be dissolved in the following cases:",
    "17_relevant_article_0_article_text_clauses_2_sub_clauses_0": "Serious violations of regulations on management, organization and operation of the school;",
    "17_relevant_article_0_article_text_clauses_2_sub_clauses_1": "The period of suspension of educational activities expires without overcoming the cause leading to the suspension;",
    "17_relevant_article_0_article_text_clauses_2_sub_clauses_2": "The objectives and content of activities in the decision to establish or authorize the establishment of a school are no longer consistent with the needs of socio-economic development;",
    "17_relevant_article_0_article_text_clauses_2_sub_clauses_3": "Does not ensure quality of education;",
    "17_relevant_article_0_article_text_clauses_2_sub_clauses_4": "At the request of organizations and individuals, schools are established.",
    "17_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "17_relevant_article_0_article_text_clauses_3_clause": "The decision to merge, divide, split, or dissolve a school must clearly identify the reasons and measures to ensure the rights and interests of teachers, educational administrators, learners, and workers in the school and must publicly announced on mass media.",
    "18_query_id": "aS4Oxqxklj",
    "18_label": "Yes",
    "18_query_text": "People 16 years of age and older are allowed to watch movies with P-rated content",
    "18_relevant_article_0_law_id": "Cinema Law 2022",
    "18_relevant_article_0_article_id": "32",
    "18_relevant_article_0_article_text_title": "Movie classification",
    "18_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "18_relevant_article_0_article_text_clauses_0_clause": "",
    "18_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "18_relevant_article_0_article_text_clauses_1_clause": "Movies are classified according to content for distribution appropriate to the age of viewers or are not allowed to be disseminated as follows:",
    "18_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Category P: Movies are allowed to be popular with viewers of all ages;",
    "18_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Category T18 (18+): Movies are popular with viewers aged 18 and over;",
    "18_relevant_article_0_article_text_clauses_1_sub_clauses_2": "Category T16 (16+): Movies are popular with viewers aged 16 and over:",
    "18_relevant_article_0_article_text_clauses_1_sub_clauses_3": "Category T13 (13+): Movies are popular with viewers aged 13 and over;",
    "18_relevant_article_0_article_text_clauses_1_sub_clauses_4": "Category K: Movies made available to viewers under 13 years of age provided they are viewed with a parent or guardian;",
    "18_relevant_article_0_article_text_clauses_1_sub_clauses_5": "Category C: Films not allowed to be distributed.",
    "18_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "18_relevant_article_0_article_text_clauses_2_clause": "Film classification criteria applicable to all forms of film dissemination are prescribed by the Minister of Culture, Sports and Tourism.",
    "19_query_id": "g4rqqRWpdb",
    "19_label": "Yes",
    "19_query_text": "During the implementation of the working contract, if one party requests to change the content of the working contract, it must notify the other party at least 3 working days in advance.",
    "19_relevant_article_0_law_id": "Law on Public Employees 2010",
    "19_relevant_article_0_article_id": "28",
    "19_relevant_article_0_article_text_title": "Change the content, re-sign, suspend and terminate the working contract",
    "19_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "19_relevant_article_0_article_text_clauses_0_clause": "",
    "19_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "19_relevant_article_0_article_text_clauses_1_clause": "During the implementation of the working contract, if one party requests to change the content of the working contract, it must notify the other party at least 3 working days in advance. Once approved, the parties proceed to amend and supplement relevant content of the working contract. During the agreement period, the parties must still comply with the signed working contract. In case no agreement can be reached, the parties continue to perform the signed working contract or agree to terminate the working contract.",
    "19_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "19_relevant_article_0_article_text_clauses_2_clause": "For fixed-term working contracts, 60 days before the expiration of the working contract, the head of the public service unit shall base on the needs of the unit and on the basis of assessing the ability to complete the tasks. of the public employee, decide to continue or terminate the working contract for the public employee.",
    "19_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "19_relevant_article_0_article_text_clauses_3_clause": "Temporary postponement of the implementation of the working contract and termination of the working contract are carried out in accordance with the provisions of labor law.",
    "19_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "19_relevant_article_0_article_text_clauses_4_clause": "When an employee transfers work to another agency, organization or unit, the working contract will be terminated and benefits and policies will be resolved according to the provisions of law.",
    "19_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "19_relevant_article_0_article_text_clauses_5_clause": "When a public employee is appointed by a competent authority to hold a position prescribed by law as a civil servant in a public service unit or decides to retire, the working contract automatically terminates.",
    "20_query_id": "4dE11xmkXc",
    "20_label": "No",
    "20_query_text": "03 months before the date of retirement, the agency, organization or unit managing the employee must notify in writing the time of retirement.",
    "20_relevant_article_0_law_id": "Law on Public Employees 2010",
    "20_relevant_article_0_article_id": "46",
    "20_relevant_article_0_article_text_title": "Pension regime",
    "20_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "20_relevant_article_0_article_text_clauses_0_clause": "",
    "20_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "20_relevant_article_0_article_text_clauses_1_clause": "Officials are entitled to retirement benefits according to the provisions of labor law and social insurance law.",
    "20_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "20_relevant_article_0_article_text_clauses_2_clause": "6 months before the employee's retirement date, the agency, organization or unit managing the employee must notify in writing the time of retirement; 3 months before the employee's retirement date, the agency, organization or unit managing the employee shall issue a decision to retire.",
    "20_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "20_relevant_article_0_article_text_clauses_3_clause": "Public service units can sign service contracts with pensioners if the unit has a need and the pensioner wishes; During the contract period, in addition to the contractual remuneration, that person is entitled to a number of specific regimes and policies on management mechanisms to ensure conditions for professional activities prescribed by the Government.",
    "21_query_id": "X2H73lQFHY",
    "21_label": "Yes",
    "21_query_text": "It is not allowed to take advantage of educational activities to distort policies and sabotage the state of the Socialist Republic of Vietnam.",
    "21_relevant_article_0_law_id": "Education Law 2019",
    "21_relevant_article_0_article_id": "21",
    "21_relevant_article_0_article_text_title": "It is forbidden to take advantage of educational activities",
    "21_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "21_relevant_article_0_article_text_clauses_0_clause": "",
    "21_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "21_relevant_article_0_article_text_clauses_1_clause": "It is forbidden to take advantage of educational activities to distort the State's guidelines, policies and laws, oppose the State of the Socialist Republic of Vietnam, divide the great national unity bloc, incite violence, propagandizing wars of invasion, destroying fine customs and traditions, spreading superstitions and bad customs, and luring learners into social evils.",
    "21_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "21_relevant_article_0_article_text_clauses_2_clause": "It is forbidden to take advantage of educational activities for personal gain.",
    "22_query_id": "4bjolT6L3z",
    "22_label": "Yes",
    "22_query_text": "The Government is the unified state management agency for youth",
    "22_relevant_article_0_law_id": "Youth Law 2020",
    "22_relevant_article_0_article_id": "37",
    "22_relevant_article_0_article_text_title": "Responsibilities of the Government",
    "22_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "22_relevant_article_0_article_text_clauses_0_clause": "",
    "22_relevant_article_0_article_text_clauses_0_sub_clauses_0": "The Government unified state management of youth and has the following responsibilities:",
    "22_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "22_relevant_article_0_article_text_clauses_1_clause": "Ensuring the effectiveness and efficiency of the implementation of state management contents on youth;",
    "22_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "22_relevant_article_0_article_text_clauses_2_clause": "Ensuring mechanisms and measures for coordination between ministries, ministerial-level agencies, Government agencies, local authorities and relevant agencies and organizations in developing and implementing policies and laws for young people;",
    "22_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "22_relevant_article_0_article_text_clauses_3_clause": "Ensure the development and implementation of youth development goals and targets in long-term, medium-term and annual socio-economic development strategies, programs and plans of the country, industry and field;",
    "22_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "22_relevant_article_0_article_text_clauses_4_clause": "Report on the results of implementation of policies and laws for youth at the request of the National Assembly.",
    "23_query_id": "zbVo7IuSOp",
    "23_label": "Yes",
    "23_query_text": "The Ho Chi Minh Communist Youth Union is the agency responsible for synthesizing and reflecting the opinions and recommendations of young people to competent agencies and organizations.",
    "23_relevant_article_0_law_id": "Youth Law 2020",
    "23_relevant_article_0_article_id": "28",
    "23_relevant_article_0_article_text_title": "Ho Chi Minh Communist Youth Union",
    "23_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "23_relevant_article_0_article_text_clauses_0_clause": "",
    "23_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "23_relevant_article_0_article_text_clauses_1_clause": "The Ho Chi Minh Communist Youth Union is a socio-political organization of Vietnamese youth, playing a core role in the youth movement and youth organization; Organize and guide activities of teenagers and children, and be in charge of the Ho Chi Minh Young Pioneers Team.",
    "23_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "23_relevant_article_0_article_text_clauses_2_clause": "The Ho Chi Minh Communist Youth Union is responsible for monitoring and social criticism of policies and laws on youth according to the provisions of law; synthesize and reflect opinions and recommendations of young people to competent agencies and organizations.",
    "23_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "23_relevant_article_0_article_text_clauses_3_clause": "The Ho Chi Minh Communist Youth Union is responsible for participating and coordinating with relevant state agencies in the process of building, propagating and organizing the implementation of policies and laws for youth.",
    "23_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "23_relevant_article_0_article_text_clauses_4_clause": "Ho Chi Minh Communist Youth Union carries out youth foreign affairs activities.",
    "24_query_id": "61bCyfsfYX",
    "24_label": "No",
    "24_query_text": "Permitting the propagation of religion and the performance of religious ceremonies in educational institutions of the national education system and political organizations.",
    "24_relevant_article_0_law_id": "Education Law 2019",
    "24_relevant_article_0_article_id": "20",
    "24_relevant_article_0_article_text_title": "Do not propagate religion in educational establishments",
    "24_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "24_relevant_article_0_article_text_clauses_0_clause": "",
    "24_relevant_article_0_article_text_clauses_0_sub_clauses_0": "Do not propagate religion or conduct religious rituals in educational establishments of the national education system, state agencies, political organizations, socio-political organizations and the people's armed forces. .",
    "25_query_id": "dIIYvZHbtq",
    "25_label": "No",
    "25_query_text": "The purpose of a reformatory school is to educate juvenile offenders for which of the following purposes? Answer: To study abroad.",
    "25_relevant_article_0_law_id": "Education Law 2019",
    "25_relevant_article_0_article_id": "64",
    "25_relevant_article_0_article_text_title": "Reformatories",
    "25_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "25_relevant_article_0_article_text_clauses_0_clause": "",
    "25_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "25_relevant_article_0_article_text_clauses_1_clause": "Reformatory schools have the task of educating juveniles who violate the law so that they can train, develop healthily, become honest people, and be able to reintegrate into social life.",
    "25_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "25_relevant_article_0_article_text_clauses_2_clause": "The Minister of Public Security is responsible for presiding over and coordinating with the Minister of Education and Training and the Minister of Labor, War Invalids and Social Affairs to prescribe educational programs for reformatories.",
    "26_query_id": "H6PxIjmdgH",
    "26_label": "Yes",
    "26_query_text": "Vietnamese education is a socialist education that is popular, national, scientific, and modern.",
    "26_relevant_article_0_law_id": "Education Law 2019",
    "26_relevant_article_0_article_id": "3",
    "26_relevant_article_0_article_text_title": "Nature and principles of education",
    "26_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "26_relevant_article_0_article_text_clauses_0_clause": "",
    "26_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "26_relevant_article_0_article_text_clauses_1_clause": "Vietnamese education is a socialist education that is popular, national, scientific, and modern, taking Marxism-Leninism and Ho Chi Minh's ideology as its foundation.",
    "26_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "26_relevant_article_0_article_text_clauses_2_clause": "Educational activities are carried out according to the principles of learning coupled with practice, theory associated with practice, school education combined with family education and social education.",
    "27_query_id": "4O7z6fOAPJ",
    "27_label": "No",
    "27_query_text": "How long is the period of voluntary drug detox at a drug detoxification facility? Answer: From 48 months to 60 months",
    "27_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "27_relevant_article_0_article_id": "31",
    "27_relevant_article_0_article_text_title": "Voluntary drug detox at a drug detoxification facility",
    "27_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "27_relevant_article_0_article_text_clauses_0_clause": "",
    "27_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "27_relevant_article_0_article_text_clauses_1_clause": "The duration of voluntary drug detoxification at a drug detoxification facility is from 6 months to 12 months.",
    "27_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "27_relevant_article_0_article_text_clauses_2_clause": "Voluntary drug addicts at drug detoxification facilities who complete at least 03 stages specified in Points a, b and c, Clause 1, Article 29 of this Law will receive financial support.",
    "27_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "27_relevant_article_0_article_text_clauses_3_clause": "Voluntary drug addicts at drug detoxification facilities have the following responsibilities:",
    "27_relevant_article_0_article_text_clauses_3_sub_clauses_0": "Correctly and fully comply with regulations on voluntary drug detoxification and comply with instructions from specialized agencies;",
    "27_relevant_article_0_article_text_clauses_3_sub_clauses_1": "Pay costs related to drug addiction treatment according to regulations.",
    "27_relevant_article_0_article_text_clauses_3_sub_clauses_2": "In cases where voluntary drug addicts at public drug detoxification facilities are in difficult circumstances, their fees will be considered for reduction or exemption.",
    "27_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "27_relevant_article_0_article_text_clauses_4_clause": "Drug detoxification facilities are responsible for issuing certificates of completion of voluntary drug detoxification to drug addicts.",
    "27_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "27_relevant_article_0_article_text_clauses_5_clause": "The Government shall detail this Article.",
    "28_query_id": "gtjDrBrJ19",
    "28_label": "No",
    "28_query_text": "Within 05 working days from the date of receiving the positive test result of a local resident, the Chairman of the People's Committee at the commune or ward level is responsible for making a decision and organizing the management of illegal drug users residing in the locality.",
    "28_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "28_relevant_article_0_article_id": "23",
    "28_relevant_article_0_article_text_title": "Management of illegal drug users",
    "28_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "28_relevant_article_0_article_text_clauses_0_clause": "",
    "28_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "28_relevant_article_0_article_text_clauses_1_clause": "Managing illegal drug users is a preventive measure to help illegal drug users not continue to illegally use drugs and prevent their illegal acts.",
    "28_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Management of illegal drug users is not an administrative measure.",
    "28_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "28_relevant_article_0_article_text_clauses_2_clause": "The time limit for managing illegal drug users is 01 year from the date the Chairman of the Commune People's Committee issues the management decision.",
    "28_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "28_relevant_article_0_article_text_clauses_3_clause": "Contents of management of illegal drug users include:",
    "28_relevant_article_0_article_text_clauses_3_sub_clauses_0": "Consulting, encouraging, educating, and helping illegal drug users so that they do not continue to illegally use drugs;",
    "28_relevant_article_0_article_text_clauses_3_sub_clauses_1": "Testing for drugs in the body;",
    "28_relevant_article_0_article_text_clauses_3_sub_clauses_2": "Prevent illegal drug users from committing acts that disrupt social order and safety.",
    "28_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "28_relevant_article_0_article_text_clauses_4_clause": "Within 03 working days from the date of receiving the positive test result of a local resident, the Chairman of the Commune People's Committee is responsible for making decisions and organizing the management of illegal users. narcotics residing locally.",
    "28_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "28_relevant_article_0_article_text_clauses_5_clause": "During the management term, the Chairman of the Commune People's Committee shall issue a decision to stop the management of illegal drug users in the following cases:",
    "28_relevant_article_0_article_text_clauses_5_sub_clauses_0": "People who illegally use drugs are identified as drug addicts;",
    "28_relevant_article_0_article_text_clauses_5_sub_clauses_1": "Illegal users of narcotics are subject to administrative and educational measures at communes, wards and towns due to illegal use of narcotics;",
    "28_relevant_article_0_article_text_clauses_5_sub_clauses_2": "Illegal drug users are subject to administrative measures of being sent to compulsory education facilities or reform schools;",
    "28_relevant_article_0_article_text_clauses_5_sub_clauses_3": "Illegal users of drugs must serve a prison sentence;",
    "28_relevant_article_0_article_text_clauses_5_sub_clauses_4": "An illegal user of drugs on the management list died and was declared missing by the Court.",
    "28_relevant_article_0_article_text_clauses_6_clause_id": "6",
    "28_relevant_article_0_article_text_clauses_6_clause": "The Government regulates this Article in detail.",
    "29_query_id": "LxjhKFcDMD",
    "29_label": "No",
    "29_query_text": "The Deputy Minister of Education and Training, within the scope of his duties and powers, regulates in detail the programs, textbooks, syllabi and documents for continuing education.",
    "29_relevant_article_0_law_id": "Education Law 2019",
    "29_relevant_article_0_article_id": "43",
    "29_relevant_article_0_article_text_title": "Program, form, content, and methods of continuing education",
    "29_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "29_relevant_article_0_article_text_clauses_0_clause": "",
    "29_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "29_relevant_article_0_article_text_clauses_1_clause": "Continuing education programs include:",
    "29_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Literacy eradication program;",
    "29_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Educational programs meet the needs of learners; Update knowledge, skills, transfer technology;",
    "29_relevant_article_0_article_text_clauses_1_sub_clauses_2": "Training and fostering programs to improve professional capacity;",
    "29_relevant_article_0_article_text_clauses_1_sub_clauses_3": "The educational program belongs to the diploma granting program of the national education system.",
    "29_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "29_relevant_article_0_article_text_clauses_2_clause": "Forms of implementation of continuing education programs include:",
    "29_relevant_article_0_article_text_clauses_2_sub_clauses_0": "Work and study at the same time;",
    "29_relevant_article_0_article_text_clauses_2_sub_clauses_1": "Distance learning;",
    "29_relevant_article_0_article_text_clauses_2_sub_clauses_2": "Self-study, guided self-study;",
    "29_relevant_article_0_article_text_clauses_2_sub_clauses_3": "Different forms of learning according to the needs of the learner.",
    "29_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "29_relevant_article_0_article_text_clauses_3_clause": "The content of the continuing education program specified in Points a, b and c, Clause 1 of this Article must ensure practicality, helping learners improve their ability to work, produce, work and quality of life.",
    "29_relevant_article_0_article_text_clauses_3_sub_clauses_0": "The content of the continuing education program specified in Point d, Clause 1 of this Article is to achieve a level in the National Education System Structural Framework and Vietnam National Qualifications Framework, and must ensure the content requirements of the program. educational program at the same educational level and training level as prescribed in Article 31 of this Law, regulations of the Law on Vocational Education and the Law on Higher Education.",
    "29_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "29_relevant_article_0_article_text_clauses_4_clause": "Continuing education methods must promote learners' initiative and attach importance to fostering self-study capacity; Use modern means and technology to improve the quality and effectiveness of teaching and learning.",
    "29_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "29_relevant_article_0_article_text_clauses_5_clause": "The Minister of Education and Training and the Minister of Labor, War Invalids and Social Affairs, within the scope of their duties and powers, shall stipulate detailed regulations on programs, textbooks, syllabuses and educational materials. regular sex.",
    "30_query_id": "jnGYfFIs7N",
    "30_label": "Yes",
    "30_query_text": "Young people who complete military service and join the People's Police are entitled to vocational training support policies according to regulations.",
    "30_relevant_article_0_law_id": "Youth Law 2020",
    "30_relevant_article_0_article_id": "21",
    "30_relevant_article_0_article_text_title": "Policy on protecting the Fatherland",
    "30_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "30_relevant_article_0_article_text_clauses_0_clause": "",
    "30_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "30_relevant_article_0_article_text_clauses_1_clause": "Ensure that young people are educated in national defense and security, patriotism, revolutionary heroism, and awareness of building and protecting the Fatherland.",
    "30_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "30_relevant_article_0_article_text_clauses_2_clause": "Ensuring young people to perform military service; Obligation to join the People's Police and Militia; Join reserve soldiers and build all-people national defense and people's security according to the provisions of law.",
    "30_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "30_relevant_article_0_article_text_clauses_3_clause": "Young people who complete military service or the obligation to join the People's Police are entitled to vocational training support policies and other preferential policies according to the provisions of law.",
    "31_query_id": "E3nezW9AK0",
    "31_label": "No",
    "31_query_text": "Category C movies are movies that are allowed to be popular with viewers of all ages",
    "31_relevant_article_0_law_id": "Cinema Law 2022",
    "31_relevant_article_0_article_id": "32",
    "31_relevant_article_0_article_text_title": "Movie classification",
    "31_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "31_relevant_article_0_article_text_clauses_0_clause": "",
    "31_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "31_relevant_article_0_article_text_clauses_1_clause": "Movies are classified according to content for distribution appropriate to the age of viewers or are not allowed to be disseminated as follows:",
    "31_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Category P: Movies are allowed to be popular with viewers of all ages;",
    "31_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Category T18 (18+): Movies are popular with viewers aged 18 and over;",
    "31_relevant_article_0_article_text_clauses_1_sub_clauses_2": "Category T16 (16+): Movies are popular with viewers aged 16 and over:",
    "31_relevant_article_0_article_text_clauses_1_sub_clauses_3": "Category T13 (13+): Movies are popular with viewers aged 13 and over;",
    "31_relevant_article_0_article_text_clauses_1_sub_clauses_4": "Category K: Films intended for viewing by viewers under 13 years of age with the condition of being viewed with a parent or guardian;",
    "31_relevant_article_0_article_text_clauses_1_sub_clauses_5": "Category C: Films not allowed to be distributed.",
    "31_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "31_relevant_article_0_article_text_clauses_2_clause": "Film classification criteria applicable to all forms of film dissemination are prescribed by the Minister of Culture, Sports and Tourism.",
    "32_query_id": "NILu7qLntt",
    "32_label": "Yes",
    "32_query_text": "Forms of training and retraining for public employees include: Training and retraining according to management position standards, training according to professional title standards, and training to supplement and update knowledge and service skills. professional activities.",
    "32_relevant_article_0_law_id": "Law on Public Employees 2010",
    "32_relevant_article_0_article_id": "33",
    "32_relevant_article_0_article_text_title": "Training and fostering regime for civil servants",
    "32_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "32_relevant_article_0_article_text_clauses_0_clause": "",
    "32_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "32_relevant_article_0_article_text_clauses_1_clause": "Training and retraining are carried out for public employees before appointing management positions, changing professional titles or to supplement and update knowledge and skills to serve professional activities.",
    "32_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "32_relevant_article_0_article_text_clauses_2_clause": "The content, program, form, and duration of training and development of civil servants must be based on the standards of management positions, professional titles, and requirements for supplementing and updating knowledge and skills to serve professional activities.",
    "32_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "32_relevant_article_0_article_text_clauses_3_clause": "Forms of training and development of civil servants include:",
    "32_relevant_article_0_article_text_clauses_3_sub_clauses_0": "Training and development according to management position standards;",
    "32_relevant_article_0_article_text_clauses_3_sub_clauses_1": "Training according to professional title standards;",
    "32_relevant_article_0_article_text_clauses_3_sub_clauses_2": "Training to supplement and update knowledge and skills to serve professional activities.",
    "32_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "32_relevant_article_0_article_text_clauses_4_clause": "Ministries and ministerial-level agencies assigned to state management of the fields of public employee activities shall regulate in detail the content, programs, forms, and duration of training and fostering public employees working in the industry. assigned management area.",
    "33_query_id": "HxZtqBzeEZ",
    "33_label": "Yes",
    "33_query_text": "March every year is Youth Month",
    "33_relevant_article_0_law_id": "Youth Law 2020",
    "33_relevant_article_0_article_id": "9",
    "33_relevant_article_0_article_text_title": "Youth Month",
    "33_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "33_relevant_article_0_article_text_clauses_0_clause": "",
    "33_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "33_relevant_article_0_article_text_clauses_1_clause": "March every year is Youth Month. Youth Month is organized to promote the spirit of initiative, volunteerism and creativity of young people to participate in activities for the benefit of the community and society and mobilize organizations and individuals to invest and develop youth. year.",
    "33_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "33_relevant_article_0_article_text_clauses_2_clause": "The Ho Chi Minh Communist Youth Union presides over and coordinates with relevant agencies, organizations and individuals to organize Youth Month activities.",
    "33_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "33_relevant_article_0_article_text_clauses_3_clause": "The Government and local authorities at all levels are responsible for creating favorable conditions in terms of mechanisms, policies and resources to support the Ho Chi Minh Communist Youth Union at the same level in organizing Youth Month activities. Heads of agencies and organizations are responsible for creating conditions and supporting young people to participate in Youth Month activities.",
    "34_query_id": "BkupPYuKXv",
    "34_label": "Yes",
    "34_query_text": "The Minister of Education and Training is not allowed to regulate entry thresholds for college and university degrees in the teacher training industry.",
    "34_relevant_article_0_law_id": "Education Law 2019",
    "34_relevant_article_0_article_id": "6",
    "34_relevant_article_0_article_text_title": "National education system",
    "34_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "34_relevant_article_0_article_text_clauses_0_clause": "",
    "34_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "34_relevant_article_0_article_text_clauses_1_clause": "The national education system is an open, interconnected education system including formal education and continuing education.",
    "34_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "34_relevant_article_0_article_text_clauses_2_clause": "Education levels and training levels of the national education system include:",
    "34_relevant_article_0_article_text_clauses_2_sub_clauses_0": "Preschool education includes kindergarten education and kindergarten education;",
    "34_relevant_article_0_article_text_clauses_2_sub_clauses_1": "General education includes elementary education, middle school education and high school education;",
    "34_relevant_article_0_article_text_clauses_2_sub_clauses_2": "Vocational education training at primary level, intermediate level, college level and other vocational training programs;",
    "34_relevant_article_0_article_text_clauses_2_sub_clauses_3": "Higher education provides undergraduate, master's and doctoral degrees.",
    "34_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "34_relevant_article_0_article_text_clauses_3_clause": "The Prime Minister decided to approve the National Education System Structural Framework and Vietnam National Qualifications Framework; regulate training time, standards for each training level, and minimum learning volume for vocational education and university education levels.",
    "34_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "34_relevant_article_0_article_text_clauses_4_clause": "The Minister of Education and Training and the Minister of Labor, War Invalids and Social Affairs, within the scope of their duties and powers, shall prescribe the entry threshold for college and university degrees in teacher training and health sectors.",
    "35_query_id": "3ZjbFGpytH",
    "35_label": "No",
    "35_query_text": "The head of a public service unit has the unilateral right to decide to continue signing or terminate the employment contract with a civil servant.",
    "35_relevant_article_0_law_id": "Law on Public Employees 2010",
    "35_relevant_article_0_article_id": "28",
    "35_relevant_article_0_article_text_title": "Change the content, re-sign, suspend and terminate the working contract",
    "35_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "35_relevant_article_0_article_text_clauses_0_clause": "",
    "35_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "35_relevant_article_0_article_text_clauses_1_clause": "During the implementation of the working contract, if one party requests to change the content of the working contract, it must notify the other party at least 3 working days in advance. Once approved, the parties proceed to amend and supplement relevant content of the working contract. During the agreement period, the parties must still comply with the signed working contract. In case no agreement can be reached, the parties continue to perform the signed working contract or agree to terminate the working contract.",
    "35_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "35_relevant_article_0_article_text_clauses_2_clause": "For fixed-term working contracts, 60 days before the expiration of the working contract, the head of the public service unit shall base on the needs of the unit and on the basis of assessing the ability to complete the tasks. of the public employee, decide to continue or terminate the working contract for the public employee.",
    "35_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "35_relevant_article_0_article_text_clauses_3_clause": "Temporary postponement of the implementation of the working contract and termination of the working contract are carried out in accordance with the provisions of labor law.",
    "35_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "35_relevant_article_0_article_text_clauses_4_clause": "When an employee transfers work to another agency, organization or unit, the working contract will be terminated and benefits and policies will be resolved according to the provisions of law.",
    "35_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "35_relevant_article_0_article_text_clauses_5_clause": "When an official is appointed by a competent authority to a position prescribed by law as a civil servant at a public service unit or has a decision to retire, the employment contract automatically terminates.",
    "36_query_id": "6T9RLlCXIy",
    "36_label": "No",
    "36_query_text": "The public service unit has the right to unilaterally terminate the contract with an employee when the employee is sick or has an accident or is being treated for an occupational disease according to the decision of the medical facility.",
    "36_relevant_article_0_law_id": "Law on Public Employees 2010",
    "36_relevant_article_0_article_id": "29",
    "36_relevant_article_0_article_text_title": "Unilateral termination of working contract",
    "36_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "36_relevant_article_0_article_text_clauses_0_clause": "",
    "36_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "36_relevant_article_0_article_text_clauses_1_clause": "Public service units may unilaterally terminate working contracts with public employees in the following cases:",
    "36_relevant_article_0_article_text_clauses_1_sub_clauses_0": "The officer has been classified for 02 consecutive years at the level of failing to complete his/her duties;",
    "36_relevant_article_0_article_text_clauses_1_sub_clauses_1": "The employee is forced to resign according to the provisions of Point d, Clause 1, Article 52 and Clause 1, Article 57 of this Law;",
    "36_relevant_article_0_article_text_clauses_1_sub_clauses_2": "An employee working under an indefinite-term employment contract who has been sick for 12 consecutive months and has been treated; an employee working under an indefinite-term employment contract who has been sick for 6 consecutive months and has not recovered his or her ability to work. When the employee's health has recovered, he or she will be considered for a new employment contract;",
    "36_relevant_article_0_article_text_clauses_1_sub_clauses_3": "Due to natural disasters, fires or other force majeure reasons according to Government regulations, public service units are forced to downsize, causing the job position that the employee is holding to no longer exist;",
    "36_relevant_article_0_article_text_clauses_1_sub_clauses_4": "When a public service unit terminates its operations according to a decision of a competent authority.",
    "36_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "36_relevant_article_0_article_text_clauses_2_clause": "When unilaterally terminating a working contract, except for the case specified in Point b, Clause 1 of this Article, the head of a public service unit must notify the public employee at least 45 days in advance for an inconsistent working contract. fixed term or at least 30 days for fixed term employment contracts. For public employees recruited by the management agency of a public service unit, unilateral termination of the working contract is decided by the head of the public service unit after obtaining written consent. of the public service unit management agency.",
    "36_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "36_relevant_article_0_article_text_clauses_3_clause": "The head of a public service unit is not allowed to unilaterally terminate the working contract with a public employee in the following cases:",
    "36_relevant_article_0_article_text_clauses_3_sub_clauses_0": "The employee is sick or has an accident or is being treated for an occupational disease according to the decision of the medical facility, except for the case specified in Point c, Clause 1 of this Article;",
    "36_relevant_article_0_article_text_clauses_3_sub_clauses_1": "Officials are on annual leave, personal leave and other leave cases permitted by the head of the public service unit;",
    "36_relevant_article_0_article_text_clauses_3_sub_clauses_2": "Female public employees who are pregnant, on maternity leave, or raising children under 36 months old, except in cases where the public service unit terminates operations.",
    "36_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "36_relevant_article_0_article_text_clauses_4_clause": "Public employees working under an indefinite term contract have the right to unilaterally terminate the contract but must notify the head of the public service unit in writing at least 45 days in advance; In case an officer is sick or has an accident and has been treated for 6 consecutive months, he/she must give notice at least 3 days in advance.",
    "36_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "36_relevant_article_0_article_text_clauses_5_clause": "Public employees working under a fixed-term employment contract have the right to unilaterally terminate the contract in the following cases:",
    "36_relevant_article_0_article_text_clauses_5_sub_clauses_0": "Not being assigned to the correct job position, work location or not ensuring the working conditions agreed upon in the work contract;",
    "36_relevant_article_0_article_text_clauses_5_sub_clauses_1": "Not being paid in full or not being paid on time according to the work contract;",
    "36_relevant_article_0_article_text_clauses_5_sub_clauses_2": "Treated badly; forced labor;",
    "36_relevant_article_0_article_text_clauses_5_sub_clauses_3": "You or your family are truly in difficult circumstances and cannot continue to perform the contract;",
    "36_relevant_article_0_article_text_clauses_5_sub_clauses_4": "Pregnant female employees must take leave from work as directed by the medical facility;",
    "36_relevant_article_0_article_text_clauses_5_sub_clauses_5": "The employee has been sick or had an accident and has been treated for 3 consecutive months but his ability to work has not recovered.",
    "36_relevant_article_0_article_text_clauses_6_clause_id": "6",
    "36_relevant_article_0_article_text_clauses_6_clause": "The public employee must notify in writing the unilateral termination of the working contract to the head of the public service unit at least 03 days in advance for the cases specified in Points a, b, c, dd and e Clause 5 of this Article; at least 30 days for the cases specified in Point d, Clause 5 of this Article.",
    "37_query_id": "smWUCz4HtS",
    "37_label": "Yes",
    "37_query_text": "The Ministry of Home Affairs is the agency that presides over and coordinates with relevant ministries and ministerial-level agencies to regulate the system of categories, standards and occupational title codes.",
    "37_relevant_article_0_law_id": "Law on Public Employees 2010",
    "37_relevant_article_0_article_id": "8",
    "37_relevant_article_0_article_text_title": "Career titles",
    "37_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "37_relevant_article_0_article_text_clauses_0_clause": "",
    "37_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "37_relevant_article_0_article_text_clauses_1_clause": "Professional title is the name that represents the professional qualifications and capabilities of public employees in each career field.",
    "37_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "37_relevant_article_0_article_text_clauses_2_clause": "The Ministry of Home Affairs presides over and coordinates with relevant ministries and ministerial-level agencies to regulate the system of categories, standards and occupational title codes.",
    "38_query_id": "W51vKx6Y5S",
    "38_label": "Yes",
    "38_query_text": "The educational program must reflect educational goals and require learners to achieve corresponding qualities and abilities.",
    "38_relevant_article_0_law_id": "Education Law 2019",
    "38_relevant_article_0_article_id": "8",
    "38_relevant_article_0_article_text_title": "Education program",
    "38_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "38_relevant_article_0_article_text_clauses_0_clause": "",
    "38_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "38_relevant_article_0_article_text_clauses_1_clause": "Educational programs express educational goals; regulate standards of knowledge, skills, and requirements for learners' qualities and abilities; scope and structure of educational content; methods and forms of organizing educational activities; How to evaluate educational outcomes for subjects in each class, each level or subjects, modules, and majors for each training level.",
    "38_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "38_relevant_article_0_article_text_clauses_2_clause": "The educational program must ensure scientific and practicality; inherit and connect between levels of education and training degrees; create conditions for streaming and conversion between training levels, training sectors and forms of education in the national education system so that localities and educational institutions can proactively implement appropriate educational plans; meet the goals of gender equality and international integration requirements. The educational program is the basis for ensuring comprehensive educational quality.",
    "38_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "38_relevant_article_0_article_text_clauses_3_clause": "Standards of knowledge, skills, and requirements for learner quality and capacity specified in the educational program must be specified in textbooks for general education; Curriculum and teaching materials for vocational education and higher education. Textbooks, textbooks and teaching materials must meet educational method requirements.",
    "38_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "38_relevant_article_0_article_text_clauses_4_clause": "The educational program is organized and implemented according to the school year for preschool and general education; according to the yearly system or by the method of accumulating modules or credits or a combination of credits and yearly system for vocational education and higher education.",
    "38_relevant_article_0_article_text_clauses_4_sub_clauses_0": "Learning results of subjects or credits or modules that a learner accumulates while studying a recognized educational program to consider the conversion value for the corresponding subject or credit or module in other educational programs when students specialize in training, change their form of study or study to a higher level of education or training level.",
    "38_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "38_relevant_article_0_article_text_clauses_5_clause": "The Minister of Education and Training and the Minister of Labor, War Invalids and Social Affairs, within the scope of their duties and powers, shall prescribe the implementation of educational programs and the recognition of the transfer value of learning outcomes in training at all levels of higher education and vocational education as prescribed in this Article.",
    "39_query_id": "7yASh5EiMy",
    "39_label": "No",
    "39_query_text": "What is the responsibility of the Ministry of Public Security in drug prevention and combat? Answer: Direct the Border Guard and Vietnam Coast Guard in drug prevention.",
    "39_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "39_relevant_article_0_article_id": "46",
    "39_relevant_article_0_article_text_title": "Responsibilities of the Ministry of Public Security",
    "39_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "39_relevant_article_0_article_text_clauses_0_clause": "",
    "39_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "39_relevant_article_0_article_text_clauses_1_clause": "Promulgate according to authority or submit to competent state agencies to promulgate legal documents on drug prevention and combat.",
    "39_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "39_relevant_article_0_article_text_clauses_2_clause": "Preside over and coordinate with relevant agencies and organizations in drug prevention and combat; Organize the reception and processing of drug crime information; Control legal activities related to drugs according to authority.",
    "39_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "39_relevant_article_0_article_text_clauses_3_clause": "Organize the assessment of narcotics and precursors.",
    "39_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "39_relevant_article_0_article_text_clauses_4_clause": "Training and fostering people who work to investigate and fight drug-related crimes.",
    "39_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "39_relevant_article_0_article_text_clauses_5_clause": "Instructions on making a list of illegal drug users, drug addicts, and people managed after drug addiction.",
    "39_relevant_article_0_article_text_clauses_6_clause_id": "6",
    "39_relevant_article_0_article_text_clauses_6_clause": "Preside over the implementation of state statistics on drug prevention and combat; Managing information about drug crimes, illegal drug users, drug addicts, people being managed after drug addiction and the results of controlling legal activities related to drugs.",
    "39_relevant_article_0_article_text_clauses_7_clause_id": "7",
    "39_relevant_article_0_article_text_clauses_7_clause": "Implement international cooperation on drug prevention and combat.",
    "40_query_id": "5aJlXB1eST",
    "40_label": "Yes",
    "40_query_text": "Officer evaluation is carried out annually",
    "40_relevant_article_0_law_id": "Law on Public Employees 2010",
    "40_relevant_article_0_article_id": "41",
    "40_relevant_article_0_article_text_title": "Content of employee evaluation",
    "40_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "40_relevant_article_0_article_text_clauses_0_clause": "",
    "40_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "40_relevant_article_0_article_text_clauses_1_clause": "The evaluation of public employees is considered according to the following contents:",
    "40_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Results of performing work or tasks according to the signed work contract;",
    "40_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Implementation of regulations on professional ethics;",
    "40_relevant_article_0_article_text_clauses_1_sub_clauses_2": "Sense of responsibility, attitude of serving the people, spirit of cooperation with colleagues and implementation of the code of conduct of public employees;",
    "40_relevant_article_0_article_text_clauses_1_sub_clauses_3": "Performance of other obligations of public employees.",
    "40_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "40_relevant_article_0_article_text_clauses_2_clause": "The evaluation of management officials is considered according to the contents specified in Clause 1 of this Article and the following contents:",
    "40_relevant_article_0_article_text_clauses_2_sub_clauses_0": "Ability to lead, manage, operate and organize task performance;",
    "40_relevant_article_0_article_text_clauses_2_sub_clauses_1": "Operational results of the unit assigned to manage and be in charge.",
    "40_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "40_relevant_article_0_article_text_clauses_3_clause": "Civil servant evaluation is conducted annually; at the end of the probationary period; before signing a new employment contract; changing job positions; considering rewards, discipline, appointment, reappointment, planning, training, and compensation.",
    "41_query_id": "lQ9frTtrtV",
    "41_label": "No",
    "41_query_text": "In cases where the recruited person is under 18 years old, the labor contract only needs to state the full name, address, date, month and year of birth of the legal representative of the recruited person.",
    "41_relevant_article_0_law_id": "Law on Public Employees 2010",
    "41_relevant_article_0_article_id": "26",
    "41_relevant_article_0_article_text_title": "Content and form of working contract",
    "41_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "41_relevant_article_0_article_text_clauses_0_clause": "",
    "41_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "41_relevant_article_0_article_text_clauses_1_clause": "The working contract has the following main contents:",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Name and address of the public service unit and the head of the public service unit;",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Full name, address, date, month and year of birth of the recruited person.",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_2": "In case the recruited person is under 18 years old, the full name, address, date, month and year of birth of the legal representative of the recruited person must be included;",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_3": "Job or duties, job position and work location;",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_4": "Rights and obligations of the parties;",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_5": "Type of contract, term and termination conditions of the employment contract;",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_6": "Salary, bonus and other benefits (if any);",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_7": "Working time, rest time;",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_8": "Apprenticeship regime (if any);",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_9": "Working conditions and issues related to labor protection;",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_10": "Social insurance, health insurance;",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_11": "Validity of the working contract;",
    "41_relevant_article_0_article_text_clauses_1_sub_clauses_12": "Other commitments are related to the nature and characteristics of the industry, field and specific conditions of public service units but are not contrary to the provisions of this Law and other relevant laws.",
    "41_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "41_relevant_article_0_article_text_clauses_2_clause": "The working contract is signed in writing between the head of the public service unit and the person recruited as an employee and is made in three copies, of which one copy is delivered to the employee.",
    "41_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "41_relevant_article_0_article_text_clauses_3_clause": "For professional positions prescribed by law appointed by the superior of the head of a public service unit, the consent of that level must be obtained before signing a working contract.",
    "42_query_id": "u4ykYXXEms",
    "42_label": "Yes",
    "42_query_text": "Public employees are allowed to carry out professional activities outside the working hours specified in the working contract and in accordance with the provisions of law.",
    "42_relevant_article_0_law_id": "Law on Public Employees 2010",
    "42_relevant_article_0_article_id": "14",
    "42_relevant_article_0_article_text_title": "Rights of public employees to conduct business and work outside of prescribed hours",
    "42_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "42_relevant_article_0_article_text_clauses_0_clause": "",
    "42_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "42_relevant_article_0_article_text_clauses_1_clause": "To work outside the working hours specified in the employment contract, except where otherwise provided by law.",
    "42_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "42_relevant_article_0_article_text_clauses_2_clause": "To sign service contracts with other agencies, organizations or units that are not prohibited by law but must complete assigned tasks and have the consent of the head of the public service unit.",
    "42_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "42_relevant_article_0_article_text_clauses_3_clause": "Contribute capital but do not participate in the management and operation of limited liability companies, joint stock companies, partnerships, cooperatives, private hospitals, private schools and private scientific research organizations, except In cases where specialized laws have different provisions.",
    "43_query_id": "x3S4gfwqxV",
    "43_label": "Yes",
    "43_query_text": "Public drug detoxification facilities are established by the Chairman of the Provincial People's Committee.",
    "43_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "43_relevant_article_0_article_id": "35",
    "43_relevant_article_0_article_text_title": "Public drug rehabilitation facility",
    "43_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "43_relevant_article_0_article_text_clauses_0_clause": "",
    "43_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "43_relevant_article_0_article_text_clauses_1_clause": "Public drug detoxification facilities are established by the decision of the Chairman of the Provincial People's Committee.",
    "43_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "43_relevant_article_0_article_text_clauses_2_clause": "Public drug detoxification facilities must arrange the following areas:",
    "43_relevant_article_0_article_text_clauses_2_sub_clauses_0": "Temporary accommodation area for people whose drug addiction status is requested to be determined and people who are in the process of preparing dossiers requesting administrative handling measures to be sent to compulsory detoxification facilities;",
    "43_relevant_article_0_article_text_clauses_2_sub_clauses_1": "Compulsory drug rehabilitation area;",
    "43_relevant_article_0_article_text_clauses_2_sub_clauses_2": "Voluntary drug rehabilitation area;",
    "43_relevant_article_0_article_text_clauses_2_sub_clauses_3": "Detoxification area for people from 12 years old to under 18 years old;",
    "43_relevant_article_0_article_text_clauses_2_sub_clauses_4": "Detoxification area for people with group A and group B infectious diseases according to the provisions of the Law on Prevention and Control of Infectious Diseases;",
    "43_relevant_article_0_article_text_clauses_2_sub_clauses_5": "Detoxification area for people who cause disorderly behavior or violate the rules and regulations of the drug detoxification facility.",
    "43_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "43_relevant_article_0_article_text_clauses_3_clause": "In the areas specified in Clause 2 of this Article, separate areas for men and separate areas for women must be arranged. People with discrepancies between the entity and gender recorded in their profile and background are managed in a separate room in the area according to the gender shown on the student entity.",
    "43_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "43_relevant_article_0_article_text_clauses_4_clause": "Activities of public drug detoxification facilities include:",
    "43_relevant_article_0_article_text_clauses_4_sub_clauses_0": "Receive and organize drug detoxification for drug addicts sent to mandatory detoxification facilities and drug addicts voluntarily detoxifying;",
    "43_relevant_article_0_article_text_clauses_4_sub_clauses_1": "Carry out identification of drug addiction;",
    "43_relevant_article_0_article_text_clauses_4_sub_clauses_2": "Receiving, managing, educating, consulting, treating withdrawal syndrome, treating mental disorders and other diseases for people who are in the process of preparing dossiers to be sent to compulsory detoxification facilities.",
    "43_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "43_relevant_article_0_article_text_clauses_5_clause": "Public drug detoxification facilities have the following rights:",
    "43_relevant_article_0_article_text_clauses_5_sub_clauses_0": "Receive drug addicts into voluntary drug detoxification in accordance with the receiving capacity of the detoxification facility;",
    "43_relevant_article_0_article_text_clauses_5_sub_clauses_1": "The head of a public drug detoxification facility may decide to apply appropriate measures to manage, educate and treat drug addicts.",
    "43_relevant_article_0_article_text_clauses_6_clause_id": "6",
    "43_relevant_article_0_article_text_clauses_6_clause": "Public drug detoxification facilities have the following responsibilities:",
    "43_relevant_article_0_article_text_clauses_6_sub_clauses_0": "Comply with regulations on determining drug addiction, drug detoxification process, and managing people who are in the process of preparing documents to request admission to a compulsory detoxification facility;",
    "43_relevant_article_0_article_text_clauses_6_sub_clauses_1": "Respect the life, health, honor, dignity, and property of drug addicts, people proposed to be identified for drug addiction status, and people in the process of preparing a profile to propose being sent to a compulsory drug addiction treatment facility;",
    "43_relevant_article_0_article_text_clauses_6_sub_clauses_2": "Ensure the rights of drug addicts during detoxification and issue certificates of completion of compulsory drug detoxification to people from 12 years old to under 18 years old;",
    "43_relevant_article_0_article_text_clauses_6_sub_clauses_3": "The head of a public drug rehabilitation facility is responsible for ensuring the operating conditions of the drug rehabilitation facility; publicly posting drug rehabilitation costs at the facility in accordance with the provisions of law;",
    "43_relevant_article_0_article_text_clauses_6_sub_clauses_4": "Prevent and combat drug smuggling into establishments;",
    "43_relevant_article_0_article_text_clauses_6_sub_clauses_5": "Within 05 working days from the date the drug addict voluntarily receives admission or voluntarily terminates the use of services or completes the drug detoxification process, he/she must notify the commune-level People's Committee of the locality. That person registers for voluntary drug addiction treatment.",
    "43_relevant_article_0_article_text_clauses_7_clause_id": "7",
    "43_relevant_article_0_article_text_clauses_7_clause": "The Government regulates the conditions for facilities, equipment, and personnel of public drug detoxification facilities and the management regime at public drug detoxification facilities.",
    "44_query_id": "ZtB35RZhRI",
    "44_label": "No",
    "44_query_text": "Continuing education methods must promote the passivity of learners.",
    "44_relevant_article_0_law_id": "Education Law 2019",
    "44_relevant_article_0_article_id": "43",
    "44_relevant_article_0_article_text_title": "Program, form, content, and method of continuing education",
    "44_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "44_relevant_article_0_article_text_clauses_0_clause": "",
    "44_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "44_relevant_article_0_article_text_clauses_1_clause": "Continuing education programs include:",
    "44_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Literacy eradication program;",
    "44_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Educational programs meet the needs of learners; Update knowledge, skills, transfer technology;",
    "44_relevant_article_0_article_text_clauses_1_sub_clauses_2": "Training and fostering programs to improve professional capacity;",
    "44_relevant_article_0_article_text_clauses_1_sub_clauses_3": "The educational program belongs to the diploma granting program of the national education system.",
    "44_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "44_relevant_article_0_article_text_clauses_2_clause": "Forms of implementation of continuing education programs include:",
    "44_relevant_article_0_article_text_clauses_2_sub_clauses_0": "Work and study at the same time;",
    "44_relevant_article_0_article_text_clauses_2_sub_clauses_1": "Distance learning;",
    "44_relevant_article_0_article_text_clauses_2_sub_clauses_2": "Self-study, guided self-study;",
    "44_relevant_article_0_article_text_clauses_2_sub_clauses_3": "Different forms of learning according to the needs of the learner.",
    "44_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "44_relevant_article_0_article_text_clauses_3_clause": "The content of the continuing education program specified in Points a, b and c, Clause 1 of this Article must ensure practicality, helping learners improve their ability to work, produce, and work, and their quality of life.",
    "44_relevant_article_0_article_text_clauses_3_sub_clauses_0": "The content of the continuing education program specified in Point d, Clause 1 of this Article is to achieve a level in the National Education System Structural Framework and Vietnam National Qualifications Framework, and must ensure the content requirements of the program. educational program at the same educational level and training level as prescribed in Article 31 of this Law, regulations of the Law on Vocational Education and the Law on Higher Education.",
    "44_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "44_relevant_article_0_article_text_clauses_4_clause": "Continuing education methods must promote learners' initiative and attach importance to fostering self-study capacity; Use modern means and technology to improve the quality and effectiveness of teaching and learning.",
    "44_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "44_relevant_article_0_article_text_clauses_5_clause": "The Minister of Education and Training and the Minister of Labor, War Invalids and Social Affairs, within the scope of their duties and powers, shall stipulate detailed regulations on programs, textbooks, syllabuses and educational materials. regular sex.",
    "45_query_id": "GE9biFGIt1",
    "45_label": "No",
    "45_query_text": "Businesses and organizations are required to prioritize recruiting young people from ethnic minorities",
    "45_relevant_article_0_law_id": "Youth Law 2020",
    "45_relevant_article_0_article_id": "25",
    "45_relevant_article_0_article_text_title": "Policy for ethnic minority youth",
    "45_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "45_relevant_article_0_article_text_clauses_0_clause": "",
    "45_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "45_relevant_article_0_article_text_clauses_1_clause": "Priority is given to ethnic minority youth in education, labor, employment, entrepreneurship, health care, physical education and sports.",
    "45_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "45_relevant_article_0_article_text_clauses_2_clause": "Support ethnic minority youth to preserve and promote national cultural identity, build a civilized lifestyle, and fight to eliminate outdated customs and practices.",
    "45_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "45_relevant_article_0_article_text_clauses_3_clause": "Prioritize the selection of training, fostering and inclusion in planning to create leadership and management resources for young ethnic minority officials, civil servants and public employees in agencies, organizations and units of the Government. Government.",
    "45_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "45_relevant_article_0_article_text_clauses_4_clause": "Encourage businesses and organizations to prioritize recruiting young people from ethnic minorities.",
    "46_query_id": "pyuKTtaCxe",
    "46_label": "Yes",
    "46_query_text": "The Ministry of Culture, Sports and Tourism is the agency that helps the Government carry out state management of cinema",
    "46_relevant_article_0_law_id": "Cinema Law 2022",
    "46_relevant_article_0_article_id": "45",
    "46_relevant_article_0_article_text_title": "Responsibility for state management of cinema of the Government and the Ministry of Culture, Sports and Tourism",
    "46_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "46_relevant_article_0_article_text_clauses_0_clause": "",
    "46_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "46_relevant_article_0_article_text_clauses_1_clause": "The Government unified state management of cinema.",
    "46_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "46_relevant_article_0_article_text_clauses_2_clause": "The Ministry of Culture, Sports and Tourism is the agency that helps the Government carry out state management of cinema and has the following responsibilities:",
    "46_relevant_article_0_article_text_clauses_2_sub_clauses_0": "Promulgate or submit to competent state agencies to promulgate and organize the implementation of policies, legal documents on cinema, strategies and plans for cinema development;",
    "46_relevant_article_0_article_text_clauses_2_sub_clauses_1": "Information, propaganda, dissemination and education of cinema laws;",
    "46_relevant_article_0_article_text_clauses_2_sub_clauses_2": "Develop national standards and technical regulations in cinematographic activities; system of statistical indicators and film industry database;",
    "46_relevant_article_0_article_text_clauses_2_sub_clauses_3": "Training, fostering and developing cinema human resources;",
    "46_relevant_article_0_article_text_clauses_2_sub_clauses_4": "International cooperation in cinematographic activities; promote and promote cinema development at home and abroad;",
    "46_relevant_article_0_article_text_clauses_2_sub_clauses_5": "Research and application of science and technology in cinematographic activities;",
    "46_relevant_article_0_article_text_clauses_2_sub_clauses_6": "Granting and revoking licenses in cinematographic activities; stop disseminating films according to authority;",
    "46_relevant_article_0_article_text_clauses_2_sub_clauses_7": "Carry out emulation and reward work in cinematographic activities;",
    "46_relevant_article_0_article_text_clauses_2_sub_clauses_8": "Inspect, examine, resolve complaints and denunciations and handle violations of law in cinematographic activities according to authority.",
    "47_query_id": "nkiX0ToLxf",
    "47_label": "No",
    "47_query_text": "Financial sources to ensure the implementation of policies for youth only include financial resources from the state budget",
    "47_relevant_article_0_law_id": "Youth Law 2020",
    "47_relevant_article_0_article_id": "6",
    "47_relevant_article_0_article_text_title": "Resources for implementing State policies towards youth",
    "47_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "47_relevant_article_0_article_text_clauses_0_clause": "",
    "47_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "47_relevant_article_0_article_text_clauses_1_clause": "The State ensures resources to develop and organize the implementation of policies for young people according to the provisions of law.",
    "47_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "47_relevant_article_0_article_text_clauses_2_clause": "Financial sources to ensure the implementation of policies for youth include the state budget; Support, aid, sponsorship and other legal contributions from domestic and foreign organizations, businesses and individuals.",
    "48_query_id": "San2cDUQSm",
    "48_label": "Yes",
    "48_query_text": "Voluntary drug addicts at drug detoxification facilities must be responsible for paying costs related to drug detoxification.",
    "48_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "48_relevant_article_0_article_id": "31",
    "48_relevant_article_0_article_text_title": "Voluntary drug detox at a drug detoxification facility",
    "48_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "48_relevant_article_0_article_text_clauses_0_clause": "",
    "48_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "48_relevant_article_0_article_text_clauses_1_clause": "The duration of voluntary drug detoxification at a drug detoxification facility is from 6 months to 12 months.",
    "48_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "48_relevant_article_0_article_text_clauses_2_clause": "Voluntary drug addicts at drug detoxification facilities who complete at least 03 stages specified in Points a, b and c, Clause 1, Article 29 of this Law will receive financial support.",
    "48_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "48_relevant_article_0_article_text_clauses_3_clause": "Voluntary drug addicts at drug detoxification facilities have the following responsibilities:",
    "48_relevant_article_0_article_text_clauses_3_sub_clauses_0": "Correctly and fully implement regulations on voluntary drug addiction treatment and comply with instructions from professional agencies;",
    "48_relevant_article_0_article_text_clauses_3_sub_clauses_1": "Pay costs related to drug addiction treatment according to regulations.",
    "48_relevant_article_0_article_text_clauses_3_sub_clauses_2": "In cases where voluntary drug addicts at public drug detoxification facilities are in difficult circumstances, their fees will be considered for reduction or exemption.",
    "48_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "48_relevant_article_0_article_text_clauses_4_clause": "Drug detoxification facilities are responsible for issuing certificates of completion of voluntary drug detoxification to drug addicts.",
    "48_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "48_relevant_article_0_article_text_clauses_5_clause": "The Government regulates this Article in detail.",
    "49_query_id": "Q7hGQ5owqU",
    "49_label": "Yes",
    "49_query_text": "Customs authorities are responsible for controlling the transit of narcotics, precursors, and narcotic drugs into the Vietnamese territory.",
    "49_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "49_relevant_article_0_article_id": "17",
    "49_relevant_article_0_article_text_title": "Controlling import, export, temporary import, re-export, temporary export, re-import, transit of narcotics, precursors, narcotic drugs, psychotropic drugs, precursor drugs, medicinal ingredients that are pharmaceutical substances addictive, psychotropic substances, precursors used as drugs",
    "49_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "49_relevant_article_0_article_text_clauses_0_clause": "",
    "49_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "49_relevant_article_0_article_text_clauses_1_clause": "The following activities must be permitted by competent authorities:",
    "49_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Import, export, temporary import, re-export, temporary export, re-import of narcotics and precursors;",
    "49_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Temporary import, re-export, temporary export, re-import of narcotic drugs, psychotropic drugs, precursor drugs, medicinal ingredients are narcotic substances, psychotropic pharmaceutical substances, precursors used as drugs.",
    "49_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "49_relevant_article_0_article_text_clauses_2_clause": "Transit activities in the Vietnamese territory of narcotics, precursors, narcotic drugs, psychotropic drugs, precursor drugs, medicinal ingredients that are narcotic active ingredients, psychotropic active ingredients, and precursors used as drugs must comply with regulations. itinerary stated in the transit permit. Agencies and organizations carrying out transit must carry out procedures and be under the control of Vietnam's Customs and competent authorities.",
    "49_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "49_relevant_article_0_article_text_clauses_3_clause": "The Government regulates this Article in detail.",
    "50_query_id": "t9xUgIsTa6",
    "50_label": "No",
    "50_query_text": "English is officially used in educational institutions.",
    "50_relevant_article_0_law_id": "Education Law 2019",
    "50_relevant_article_0_article_id": "11",
    "50_relevant_article_0_article_text_title": "Language and writing used in educational institutions",
    "50_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "50_relevant_article_0_article_text_clauses_0_clause": "",
    "50_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "50_relevant_article_0_article_text_clauses_1_clause": "Vietnamese is the official language used in educational institutions. Based on educational goals and specific requirements on educational content, the Government regulates teaching and learning in foreign languages in educational institutions.",
    "50_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "50_relevant_article_0_article_text_clauses_2_clause": "The State encourages and creates conditions for ethnic minorities to learn their ethnic languages and scripts according to Government regulations; People with hearing and speaking disabilities are taught in sign language, and people with visual disabilities are taught in Braille according to the provisions of the Law on People with Disabilities.",
    "50_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "50_relevant_article_0_article_text_clauses_3_clause": "The foreign language specified in the educational program is the language commonly used in international transactions. The organization of foreign language teaching in educational establishments must ensure that learners learn continuously and effectively.",
    "51_query_id": "vER50gJIY7",
    "51_label": "Yes",
    "51_query_text": "The aim of continuing education is to create conditions for people to have the opportunity to work and study continuously.",
    "51_relevant_article_0_law_id": "Education Law 2019",
    "51_relevant_article_0_article_id": "41",
    "51_relevant_article_0_article_text_title": "Objectives of continuing education",
    "51_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "51_relevant_article_0_article_text_clauses_0_clause": "",
    "51_relevant_article_0_article_text_clauses_0_sub_clauses_0": "Continuing education aims to create conditions for people to work while studying, continuously learning, and lifelong learning to promote personal capacity, perfect personality, expand knowledge, and improve educational and professional qualifications. subjects and professions to find jobs, create jobs and adapt to social life; contribute to building a learning society.",
    "52_query_id": "PqLFyODSMe",
    "52_label": "Yes",
    "52_query_text": "Candidates who have been recruited as civil servants and have spent 12 months or more performing their expertise and skills in accordance with the requirements of the recruited job position are not required to undergo a probationary period.",
    "52_relevant_article_0_law_id": "Law on Public Employees 2010",
    "52_relevant_article_0_article_id": "27",
    "52_relevant_article_0_article_text_title": "Apprentice mode",
    "52_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "52_relevant_article_0_article_text_clauses_0_clause": "",
    "52_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "52_relevant_article_0_article_text_clauses_1_clause": "People who are recruited as civil servants must undergo a probationary period, except in cases where they have spent 12 months or more performing expertise and operations in accordance with the requirements of the recruited job position.",
    "52_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "52_relevant_article_0_article_text_clauses_2_clause": "The probationary period ranges from 3 to 12 months and must be specified in the working contract.",
    "52_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "52_relevant_article_0_article_text_clauses_3_clause": "The Government regulates the internship regime in detail.",
    "53_query_id": "FsWvvO33Ct",
    "53_label": "No",
    "53_query_text": "Teachers have which of the following roles? Answer: Study abroad to improve your knowledge.",
    "53_relevant_article_0_law_id": "Education Law 2019",
    "53_relevant_article_0_article_id": "66",
    "53_relevant_article_0_article_text_title": "Position and role of teachers",
    "53_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "53_relevant_article_0_article_text_clauses_0_clause": "",
    "53_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "53_relevant_article_0_article_text_clauses_1_clause": "Teachers are responsible for teaching and educating in educational establishments, except for educational establishments specified in Point c, Clause 1, Article 65 of this Law.",
    "53_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Educators who teach at preschool education establishments, general education establishments, other educational establishments, and teach elementary and intermediate levels are called teachers; Educators who teach at college level or higher are called lecturers.",
    "53_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "53_relevant_article_0_article_text_clauses_2_clause": "Teachers have a decisive role in ensuring the quality of education, have an important position in society, and are honored by society.",
    "54_query_id": "wIaqSKIotB",
    "54_label": "Yes",
    "54_query_text": "The Ministry of Culture, Sports and Tourism and the People's Committee have the authority to grant film classification licenses when meeting the conditions prescribed by the Minister of Culture, Sports and Tourism.",
    "54_relevant_article_0_law_id": "Cinema Law 2022",
    "54_relevant_article_0_article_id": "27",
    "54_relevant_article_0_article_text_title": "Issuance of Film Classification License",
    "54_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "54_relevant_article_0_article_text_clauses_0_clause": "",
    "54_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "54_relevant_article_0_article_text_clauses_1_clause": "The authority to grant film classification licenses is specified as follows:",
    "54_relevant_article_0_article_text_clauses_1_sub_clauses_0": "The Ministry of Culture, Sports and Tourism issues licenses to classify popular films in cinemas; at public cinema locations; in cyberspace in the cases specified in Point b, Clause 2, Article 21 of this Law; at the headquarters of diplomatic agencies and foreign cultural establishments established in Vietnam specified in Article 24 of this Law;",
    "54_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Provincial People's Committees are granted film classification licenses when they meet the conditions prescribed by the Minister of Culture, Sports and Tourism.",
    "54_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "54_relevant_article_0_article_text_clauses_2_clause": "The film classification license issued by the Ministry of Culture, Sports and Tourism and the Provincial People's Committee is valid nationwide.",
    "54_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "54_relevant_article_0_article_text_clauses_3_clause": "Dossier to request a film classification license includes:",
    "54_relevant_article_0_article_text_clauses_3_sub_clauses_0": "Written request for a film classification license according to the form prescribed by the Minister of Culture, Sports and Tourism;",
    "54_relevant_article_0_article_text_clauses_3_sub_clauses_1": "Copy of document proving ownership of the film or legal right to use the film;",
    "54_relevant_article_0_article_text_clauses_3_sub_clauses_2": "Complete film version;",
    "54_relevant_article_0_article_text_clauses_3_sub_clauses_3": "Movie captions in Vietnamese for foreign movies.",
    "54_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "54_relevant_article_0_article_text_clauses_4_clause": "The order and procedures for granting a film classification license are prescribed as follows:",
    "54_relevant_article_0_article_text_clauses_4_sub_clauses_0": "Organizations and individuals submit 01 set of documents through the National Public Service Portal or by post or directly to the competent state agency specified in Clause 1 of this Article;",
    "54_relevant_article_0_article_text_clauses_4_sub_clauses_1": "Within 15 days from the date of receipt of complete and valid documents, the competent state agency shall issue a film classification license according to the form prescribed by the Minister of Culture, Sports and Tourism; In case of not granting a License, a written response must be made clearly stating the reason.",
    "54_relevant_article_0_article_text_clauses_4_sub_clauses_2": "In case the film must have its content adjusted or the file must have its information amended or supplemented at the request of the competent state agency specified in Clause 1 of this Article. Within 15 days from the date of receipt of the film with adjusted content, 10 days from the date of receipt of the amended dossier with complete information, the competent state agency shall issue the license. .",
    "55_query_id": "hqnWjRtgDK",
    "55_label": "No",
    "55_query_text": "Recruitment of civil servants is only done through examinations",
    "55_relevant_article_0_law_id": "Law on Public Employees 2010",
    "55_relevant_article_0_article_id": "23",
    "55_relevant_article_0_article_text_title": "Recruitment method",
    "55_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "55_relevant_article_0_article_text_clauses_0_clause": "",
    "55_relevant_article_0_article_text_clauses_0_sub_clauses_0": "Recruitment of civil servants is done through examination or selection.",
    "56_query_id": "7eoNvR742A",
    "56_label": "Yes",
    "56_query_text": "The movie owner has the obligation to open the movie lock code for comparison and inspection upon request from a competent state agency.",
    "56_relevant_article_0_law_id": "Cinema Law 2022",
    "56_relevant_article_0_article_id": "35",
    "56_relevant_article_0_article_text_title": "Rights and responsibilities of the Film Archive",
    "56_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "56_relevant_article_0_article_text_clauses_0_clause": "",
    "56_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "56_relevant_article_0_article_text_clauses_1_clause": "Store, provide copies, and print excerpts of documents for film owners and competent state agencies according to the provisions of law.",
    "56_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "56_relevant_article_0_article_text_clauses_2_clause": "Cooperate with domestic and foreign organizations and individuals in film preservation, storage and restoration activities; exploit films according to agreements with film owners.",
    "56_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "56_relevant_article_0_article_text_clauses_3_clause": "Buy and receive valuable domestic and foreign film transfers to serve research, teaching and learning.",
    "56_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "56_relevant_article_0_article_text_clauses_4_clause": "Providing hosting services; sell, rent, and disseminate archived films according to agreement with the film owner.",
    "56_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "56_relevant_article_0_article_text_clauses_5_clause": "Ensuring the safety of film copies, scripts and accompanying documents according to technical standards.",
    "56_relevant_article_0_article_text_clauses_6_clause_id": "6",
    "56_relevant_article_0_article_text_clauses_6_clause": "Responsible before the law for ensuring intellectual property rights for films stored at the facility.",
    "57_query_id": "PXDpRnKfph",
    "57_label": "No",
    "57_query_text": "Developing education is not a top national policy.",
    "57_relevant_article_0_law_id": "Education Law 2019",
    "57_relevant_article_0_article_id": "2",
    "57_relevant_article_0_article_text_title": "Educational goals",
    "57_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "57_relevant_article_0_article_text_clauses_0_clause": "",
    "57_relevant_article_0_article_text_clauses_0_sub_clauses_0": "The educational goal is to comprehensively develop Vietnamese people with ethics, knowledge, culture, health, aesthetics and profession; have qualities, capacity and civic awareness; have patriotism, national spirit, loyalty to the ideals of national independence and socialism; promote the potential and creativity of each individual; improve people's knowledge, develop human resources, foster talents, meet the requirements of the cause of building and protecting the Fatherland and international integration.",
    "58_query_id": "g0tEL4A3EC",
    "58_label": "Yes",
    "58_query_text": "Agencies and organizations are responsible for creating favorable conditions for officials, civil servants, public employees and workers to regularly study and learn throughout their lives for the purpose of self-development and improving the quality of life. living.",
    "58_relevant_article_0_law_id": "Education Law 2019",
    "58_relevant_article_0_article_id": "46",
    "58_relevant_article_0_article_text_title": "Policy for developing continuing education",
    "58_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "58_relevant_article_0_article_text_clauses_0_clause": "",
    "58_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "58_relevant_article_0_article_text_clauses_1_clause": "The State has a policy of investing in developing continuing education, implementing education for everyone, promoting adult learning, and building a learning society; Encourage organizations and individuals to participate and provide quality continuing education services, meeting the lifelong learning needs of learners.",
    "58_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "58_relevant_article_0_article_text_clauses_2_clause": "Agencies and organizations are responsible for creating favorable conditions for officials, civil servants, public employees and workers to regularly study and learn lifelong to develop themselves and improve the quality of life.",
    "58_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "58_relevant_article_0_article_text_clauses_3_clause": "Vocational education institutions and higher education institutions are responsible for coordinating with continuing education institutions in providing learning materials to continuing education institutions to meet the learning needs of learners; Educational institutions that train teachers are responsible for researching educational science, training and fostering teachers of continuing education institutions.",
    "59_query_id": "vawQxejhbP",
    "59_label": "No",
    "59_query_text": "Drug detoxification facilities are not responsible for issuing certificates of completion of voluntary drug detoxification to drug addicts.",
    "59_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "59_relevant_article_0_article_id": "31",
    "59_relevant_article_0_article_text_title": "Voluntary drug detox at a drug detoxification facility",
    "59_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "59_relevant_article_0_article_text_clauses_0_clause": "",
    "59_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "59_relevant_article_0_article_text_clauses_1_clause": "The duration of voluntary drug detoxification at a drug detoxification facility is from 6 months to 12 months.",
    "59_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "59_relevant_article_0_article_text_clauses_2_clause": "Voluntary drug addicts at drug detoxification facilities who complete at least 03 stages specified in Points a, b and c, Clause 1, Article 29 of this Law will receive financial support.",
    "59_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "59_relevant_article_0_article_text_clauses_3_clause": "Voluntary drug addicts at drug detoxification facilities have the following responsibilities:",
    "59_relevant_article_0_article_text_clauses_3_sub_clauses_0": "Correctly and fully comply with regulations on voluntary drug detoxification and comply with instructions from specialized agencies;",
    "59_relevant_article_0_article_text_clauses_3_sub_clauses_1": "Pay costs related to drug addiction treatment according to regulations.",
    "59_relevant_article_0_article_text_clauses_3_sub_clauses_2": "In cases where voluntary drug addicts at public drug detoxification facilities are in difficult circumstances, their fees will be considered for reduction or exemption.",
    "59_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "59_relevant_article_0_article_text_clauses_4_clause": "Drug detoxification facilities are responsible for issuing certificates of completion of voluntary drug detoxification to drug addicts.",
    "59_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "59_relevant_article_0_article_text_clauses_5_clause": "The Government regulates this Article in detail.",
    "60_query_id": "ESrSFegdnP",
    "60_label": "Yes",
    "60_query_text": "Youth organizations include the Ho Chi Minh Communist Youth Union, the Vietnam Youth Union, the Vietnamese Student Association and other youth organizations established, organized and operating in accordance with the law.",
    "60_relevant_article_0_law_id": "Youth Law 2020",
    "60_relevant_article_0_article_id": "27",
    "60_relevant_article_0_article_text_title": "Youth organization",
    "60_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "60_relevant_article_0_article_text_clauses_0_clause": "",
    "60_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "60_relevant_article_0_article_text_clauses_1_clause": "Youth organizations include the Ho Chi Minh Communist Youth Union, the Vietnam Youth Union, the Vietnamese Student Association and other youth organizations established, organized and operating in accordance with the law.",
    "60_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "60_relevant_article_0_article_text_clauses_2_clause": "Youth organizations have the role of uniting and gathering young people, representing, caring for and protecting the legal and legitimate rights and interests of young people; promote the role of youth in the cause of building and protecting the Fatherland.",
    "60_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "60_relevant_article_0_article_text_clauses_3_clause": "Youth organizations are responsible for researching the needs and aspirations of young people to make recommendations to competent agencies and organizations; coordinate with state management agencies on youth and relevant agencies in propaganda, education, and implementation of policies and laws for youth; Organize youth to participate in movements for the benefit of the community, society, and for the cause of building and protecting the Fatherland.",
    "61_query_id": "tXRGZXvUPj",
    "61_label": "No",
    "61_query_text": "People who have completely served the decision to apply administrative measures to be sent to a mandatory drug detoxification facility must be subject to post-drug detoxification management for a period of 5 years from the date of complete execution of the decision.",
    "61_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "61_relevant_article_0_article_id": "40",
    "61_relevant_article_0_article_text_title": "Post-rehab management of drug addiction at residence",
    "61_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "61_relevant_article_0_article_text_clauses_0_clause": "",
    "61_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "61_relevant_article_0_article_text_clauses_1_clause": "People who have completed voluntary drug detoxification, people who have completed treatment for opiate addiction with alternative medicine, people from 12 years old to under 18 years old who have completed the decision to be sent to a mandatory detoxification facility. forced to submit to post-drug detoxification management for a period of 01 year from the date of completion of detoxification or complete compliance with the decision.",
    "61_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "61_relevant_article_0_article_text_clauses_2_clause": "People who have completed the decision to apply administrative handling measures and send them to a compulsory detoxification facility must be subject to post-drug detoxification management for a period of 02 years from the date of completion of the decision.",
    "61_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "61_relevant_article_0_article_text_clauses_3_clause": "Post-drug addiction management includes:",
    "61_relevant_article_0_article_text_clauses_3_sub_clauses_0": "Make a list of people being managed after drug addiction treatment;",
    "61_relevant_article_0_article_text_clauses_3_sub_clauses_1": "Consulting, helping, preventing and combating drug addiction relapse;",
    "61_relevant_article_0_article_text_clauses_3_sub_clauses_2": "Monitor, detect and prevent illegal use of drugs.",
    "61_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "61_relevant_article_0_article_text_clauses_4_clause": "Social support during drug addiction management includes:",
    "61_relevant_article_0_article_text_clauses_4_sub_clauses_0": "Support for cultural education for people from 12 years old to under 18 years old;",
    "61_relevant_article_0_article_text_clauses_4_sub_clauses_1": "Support for vocational training, loans, job search and participation in social activities to integrate into the community.",
    "61_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "61_relevant_article_0_article_text_clauses_5_clause": "The Chairman of the People's Committee at the commune level makes decisions and organizes management and social support after drug addiction treatment.",
    "61_relevant_article_0_article_text_clauses_6_clause_id": "6",
    "61_relevant_article_0_article_text_clauses_6_clause": "The Government regulates documents, order, procedures, management regime and support policies for people being managed after drug addiction.",
    "62_query_id": "ddUhS1oQlT",
    "62_label": "No",
    "62_query_text": "Voluntary drug detoxification facilities are established by state agencies.",
    "62_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "62_relevant_article_0_article_id": "36",
    "62_relevant_article_0_article_text_title": "Voluntary drug rehabilitation facility",
    "62_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "62_relevant_article_0_article_text_clauses_0_clause": "",
    "62_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "62_relevant_article_0_article_text_clauses_1_clause": "Voluntary drug detoxification facilities are established by individuals and organizations providing drug detoxification services. The Government regulates the conditions, authority, order, and procedures for granting and revoking operating licenses of voluntary drug detoxification facilities.",
    "62_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "62_relevant_article_0_article_text_clauses_2_clause": "Voluntary drug detoxification facilities have the following rights:",
    "62_relevant_article_0_article_text_clauses_2_sub_clauses_0": "Receive drug addicts into voluntary drug detoxification in accordance with the receiving capacity of the detoxification facility;",
    "62_relevant_article_0_article_text_clauses_2_sub_clauses_1": "Receive expenses related to drug addiction treatment;",
    "62_relevant_article_0_article_text_clauses_2_sub_clauses_2": "Enjoy preferential treatment according to the provisions of law.",
    "62_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "62_relevant_article_0_article_text_clauses_3_clause": "Voluntary drug detoxification establishments have the following responsibilities:",
    "62_relevant_article_0_article_text_clauses_3_sub_clauses_0": "Comply with the drug detoxification process;",
    "62_relevant_article_0_article_text_clauses_3_sub_clauses_1": "Respect the life, health, honor, dignity, and property of drug addicts;",
    "62_relevant_article_0_article_text_clauses_3_sub_clauses_2": "Ensure the rights of drug addicts from 12 years old to under 18 years old during drug rehabilitation;",
    "62_relevant_article_0_article_text_clauses_3_sub_clauses_3": "The head of the drug detoxification facility is responsible for ensuring the operating conditions of the drug detoxification facility; publicly post costs related to drug addiction treatment at the facility according to the provisions of law;",
    "62_relevant_article_0_article_text_clauses_3_sub_clauses_4": "Prevent and combat drug smuggling into establishments;",
    "62_relevant_article_0_article_text_clauses_3_sub_clauses_5": "Arrange separate areas or rooms when receiving people from 12 years old to under 18 years old, people with group A and group B infectious diseases according to the provisions of the Law on Prevention and Control of Infectious Diseases, and women; People with discrepancies between the entity and gender recorded in their profile and background are managed in a separate room in the area according to the gender shown on the student entity;",
    "62_relevant_article_0_article_text_clauses_3_sub_clauses_6": "Within 05 working days from the date a drug addict is admitted or voluntarily terminates the use of the service or completes the drug addiction treatment process, the People's Committee of the commune where the person registered for voluntary drug addiction treatment must be notified.",
    "63_query_id": "70KK5g4fPJ",
    "63_label": "No",
    "63_query_text": "Cheating in studies and exams is allowed. At the same time, students are allowed to smoke, drink alcohol and gamble.",
    "63_relevant_article_0_law_id": "Education Law 2019",
    "63_relevant_article_0_article_id": "22",
    "63_relevant_article_0_article_text_title": "Behaviors that are strictly prohibited in educational establishments",
    "63_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "63_relevant_article_0_article_text_clauses_0_clause": "",
    "63_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "63_relevant_article_0_article_text_clauses_1_clause": "Insulting the dignity and honor of teachers, officials, employees of educational establishments and learners.",
    "63_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "63_relevant_article_0_article_text_clauses_2_clause": "Distorting educational content.",
    "63_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "63_relevant_article_0_article_text_clauses_3_clause": "Cheating in studies, tests, exams, and admission.",
    "63_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "63_relevant_article_0_article_text_clauses_4_clause": "Smoke; drink beer; disrupt security and order.",
    "63_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "63_relevant_article_0_article_text_clauses_5_clause": "Forcing students to take extra classes to collect money.",
    "63_relevant_article_0_article_text_clauses_6_clause_id": "6",
    "63_relevant_article_0_article_text_clauses_6_clause": "Taking advantage of sponsorship and educational support to force contributions in money or in kind.",
    "64_query_id": "cCS4VENPft",
    "64_label": "Yes",
    "64_query_text": "Professional title is the name that represents the professional qualifications and capabilities of public employees in each career field.",
    "64_relevant_article_0_law_id": "Law on Public Employees 2010",
    "64_relevant_article_0_article_id": "8",
    "64_relevant_article_0_article_text_title": "Career titles",
    "64_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "64_relevant_article_0_article_text_clauses_0_clause": "",
    "64_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "64_relevant_article_0_article_text_clauses_1_clause": "Professional title is the name that shows the level and professional capacity of civil servants in each professional field.",
    "64_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "64_relevant_article_0_article_text_clauses_2_clause": "The Ministry of Home Affairs presides over and coordinates with relevant ministries and ministerial-level agencies to regulate the system of categories, standards and occupational title codes.",
    "65_query_id": "p4zs0isjph",
    "65_label": "Yes",
    "65_query_text": "Commune-level police are responsible for helping the People's Committee of the same level compile a list of illegal drug users in the locality.",
    "65_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "65_relevant_article_0_article_id": "26",
    "65_relevant_article_0_article_text_title": "Make a list of illegal drug users",
    "65_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "65_relevant_article_0_article_text_clauses_0_clause": "",
    "65_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "65_relevant_article_0_article_text_clauses_1_clause": "Commune-level police help the People's Committee of the same level compile a list of illegal drug users residing in the locality.",
    "65_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "65_relevant_article_0_article_text_clauses_2_clause": "When an illegal drug user changes his/her place of residence, the commune-level police of the place of departure shall be responsible for notifying the commune-level police of the place of arrival within 05 working days from the date the person leaves the locality to include him/her in the list and continue to manage him/her.",
    "65_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "65_relevant_article_0_article_text_clauses_3_clause": "Commune-level police help the People's Committee of the same level remove people from the list of illegal drug users in the following cases:",
    "65_relevant_article_0_article_text_clauses_3_sub_clauses_0": "Illegal users of narcotics do not have any acts of illegal use of narcotics during the management period specified in Clause 2, Article 23 of this Law;",
    "65_relevant_article_0_article_text_clauses_3_sub_clauses_1": "Illegal users of narcotics are subject to suspension of management specified in Clause 5, Article 23 of this Law;",
    "65_relevant_article_0_article_text_clauses_3_sub_clauses_2": "Illegal drug users move to another locality.",
    "66_query_id": "eDDeyyw6JY",
    "66_label": "Yes",
    "66_query_text": "The state budget plays a leading role in total investment resources for education.",
    "66_relevant_article_0_law_id": "Education Law 2019",
    "66_relevant_article_0_article_id": "17",
    "66_relevant_article_0_article_text_title": "Invest in education",
    "66_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "66_relevant_article_0_article_text_clauses_0_clause": "",
    "66_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "66_relevant_article_0_article_text_clauses_1_clause": "Investing in education is investing in development. Investment in the field of education is an investment activity in a conditional business investment industry and is eligible for incentives and investment support according to the provisions of law.",
    "66_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "66_relevant_article_0_article_text_clauses_2_clause": "The State prioritizes investment and attracts other investment sources for education; Prioritize investment in universalizing education and developing education in mountainous areas, islands, ethnic minority areas, areas with particularly difficult socio-economic conditions, and areas with industrial parks.",
    "66_relevant_article_0_article_text_clauses_2_sub_clauses_0": "The State encourages and protects the legitimate rights and interests of domestic organizations and individuals, Vietnamese residing abroad, and foreign organizations and individuals investing in education.",
    "66_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "66_relevant_article_0_article_text_clauses_3_clause": "The state budget plays a leading role in total investment resources for education.",
    "67_query_id": "OU3MJaS8Si",
    "67_label": "No",
    "67_query_text": "Public service units cannot sign service contracts with pensioners, even if the unit has a need and the pensioner wishes.",
    "67_relevant_article_0_law_id": "Law on Public Employees 2010",
    "67_relevant_article_0_article_id": "46",
    "67_relevant_article_0_article_text_title": "Pension regime",
    "67_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "67_relevant_article_0_article_text_clauses_0_clause": "",
    "67_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "67_relevant_article_0_article_text_clauses_1_clause": "Officials are entitled to retirement benefits according to the provisions of labor law and social insurance law.",
    "67_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "67_relevant_article_0_article_text_clauses_2_clause": "6 months before the employee's retirement date, the agency, organization or unit managing the employee must notify in writing the time of retirement; 3 months before the employee's retirement date, the agency, organization or unit managing the employee shall issue a decision to retire.",
    "67_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "67_relevant_article_0_article_text_clauses_3_clause": "Public service units may sign contracts for work with pensioners if the unit has a need and the pensioner wishes; during the contract period, in addition to the contractual remuneration, the pensioner shall enjoy a number of specific regimes and policies on management mechanisms to ensure conditions for professional activities as prescribed by the Government.",
    "68_query_id": "31WyXImQt7",
    "68_label": "Yes",
    "68_query_text": "The responsibility of the Vietnam Fatherland Front in drug prevention and control is to prevent and stop its members and all citizens from violating the law on drug prevention and control.",
    "68_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "68_relevant_article_0_article_id": "10",
    "68_relevant_article_0_article_text_title": "Responsibilities of the Vietnam Fatherland Front, its member organizations and other organizations",
    "68_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "68_relevant_article_0_article_text_clauses_0_clause": "",
    "68_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "68_relevant_article_0_article_text_clauses_1_clause": "Organize and coordinate with competent agencies to propagate and disseminate knowledge and laws on drug prevention and combat among the People; Mobilize people to participate in drug prevention and combat and carry out anti-drug movements.",
    "68_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "68_relevant_article_0_article_text_clauses_2_clause": "Prevent and prevent people from your organization and all citizens from violating the law on drug prevention and control.",
    "68_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "68_relevant_article_0_article_text_clauses_3_clause": "Coordinate with local authorities at all levels and competent agencies to mobilize drug addicts to implement drug addiction treatment measures, treat addiction to opium-like substances with substitution drugs; participate in rehabilitating, educating, providing vocational training, finding jobs and helping people after drug rehabilitation to integrate into the community; prevent and combat drug relapse.",
    "69_query_id": "InehZtAZn9",
    "69_label": "Yes",
    "69_query_text": "Officials who are disciplined from reprimand to dismissal shall not carry out planning, training, fostering or appointment within 12 months from the effective date of the disciplinary decision.",
    "69_relevant_article_0_law_id": "Law on Public Employees 2010",
    "69_relevant_article_0_article_id": "56",
    "69_relevant_article_0_article_text_title": "Other regulations related to disciplining officials",
    "69_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "69_relevant_article_0_article_text_clauses_0_clause": "",
    "69_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "69_relevant_article_0_article_text_clauses_1_clause": "If an employee is reprimanded, the salary increase period will be extended by 3 months; If you receive a warning, the salary increase period will be extended for 6 months. In case an employee is dismissed, the salary increase period will be extended for 12 months, and the public service unit will arrange another suitable job position.",
    "69_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "69_relevant_article_0_article_text_clauses_2_clause": "Officials who are disciplined from reprimand to dismissal shall not carry out planning, training, fostering or appointment within 12 months from the effective date of the disciplinary decision.",
    "69_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "69_relevant_article_0_article_text_clauses_3_clause": "Officials who are under disciplinary action, being investigated, prosecuted, or adjudicated shall not be appointed, seconded, trained, fostered, or considered for retirement or termination.",
    "69_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "69_relevant_article_0_article_text_clauses_4_clause": "A management official who has been disciplined by dismissal due to corruption or convicted by the Court for corruption shall not be appointed to a management position.",
    "69_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "69_relevant_article_0_article_text_clauses_5_clause": "For public employees who are banned from practicing their profession or whose professional activities are restricted for a certain period of time according to a decision of a competent authority, the public service unit must arrange for them to resign. public employees entering other employment positions not related to prohibited or restricted professional activities.",
    "69_relevant_article_0_article_text_clauses_6_clause_id": "6",
    "69_relevant_article_0_article_text_clauses_6_clause": "An employee who is disciplined, temporarily suspended from work or must pay compensation or refund according to the decision of the public service unit, if found unsatisfactory, has the right to complain, sue or request settlement according to the law. procedure prescribed by law.",
    "70_query_id": "xcuMZRBDKw",
    "70_label": "Yes",
    "70_query_text": "The Ho Chi Minh Communist Youth Union is a socio-political organization of Vietnamese youth, playing a core role in the youth movement and youth organization; Organize and guide activities of teenagers and children, and be in charge of the Ho Chi Minh Young Pioneers Team",
    "70_relevant_article_0_law_id": "Youth Law 2020",
    "70_relevant_article_0_article_id": "28",
    "70_relevant_article_0_article_text_title": "Ho Chi Minh Communist Youth Union",
    "70_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "70_relevant_article_0_article_text_clauses_0_clause": "",
    "70_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "70_relevant_article_0_article_text_clauses_1_clause": "The Ho Chi Minh Communist Youth Union is a socio-political organization of Vietnamese youth, playing a core role in the youth movement and youth organization; Organize and guide activities of teenagers and children, and be in charge of the Ho Chi Minh Young Pioneers Team.",
    "70_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "70_relevant_article_0_article_text_clauses_2_clause": "The Ho Chi Minh Communist Youth Union is responsible for monitoring and social criticism of policies and laws on youth according to the provisions of law; synthesize and reflect opinions and recommendations of young people to competent agencies and organizations.",
    "70_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "70_relevant_article_0_article_text_clauses_3_clause": "The Ho Chi Minh Communist Youth Union is responsible for participating and coordinating with relevant state agencies in the process of building, propagating and organizing the implementation of policies and laws for youth.",
    "70_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "70_relevant_article_0_article_text_clauses_4_clause": "Ho Chi Minh Communist Youth Union carries out youth foreign affairs activities.",
    "71_query_id": "3lEnngVd8Z",
    "71_label": "Yes",
    "71_query_text": "If an employee is reprimanded, the salary increase period will be extended by 3 months",
    "71_relevant_article_0_law_id": "Law on Public Employees 2010",
    "71_relevant_article_0_article_id": "9",
    "71_relevant_article_0_article_text_title": "Public service units and organizational structure for managing operations of public service units",
    "71_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "71_relevant_article_0_article_text_clauses_0_clause": "",
    "71_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "71_relevant_article_0_article_text_clauses_1_clause": "A public service unit is an organization established by a competent State agency, political organization, or socio-political organization in accordance with the law, has legal status, and provides services. public service, serving state management.",
    "71_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "71_relevant_article_0_article_text_clauses_2_clause": "Public service units include:",
    "71_relevant_article_0_article_text_clauses_2_sub_clauses_0": "Public service units are assigned complete autonomy in terms of task performance, finance, organizational structure, and personnel (hereinafter referred to as public service units assigned autonomy);",
    "71_relevant_article_0_article_text_clauses_2_sub_clauses_1": "Public service units that have not been given complete autonomy in terms of task performance, finance, organizational structure, and personnel (hereinafter referred to as public service units that have not been given autonomy).",
    "71_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "71_relevant_article_0_article_text_clauses_3_clause": "The Government regulates in detail the criteria for classifying public service units specified in Clause 2 of this Article for each service sector based on the ability to be autonomous in performing tasks, finance, and organizational structure. , personnel and scope of operations of public service units.",
    "71_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "71_relevant_article_0_article_text_clauses_4_clause": "Based on the specific conditions and management requirements for each type of public service unit in each field, the Government regulates the establishment, functional structure, tasks and powers of the Management Council. In public service units, the relationship between the Management Board and the head of the public service unit.",
    "72_query_id": "6nfjyV5thx",
    "72_label": "No",
    "72_query_text": "State agencies do not have the authority to monitor, inspect, and supervise drug research and production activities (excluding the cultivation of plants containing drugs).",
    "72_relevant_article_0_law_id": "Law on Drug Prevention and Control 2021",
    "72_relevant_article_0_article_id": "14",
    "72_relevant_article_0_article_text_title": "Control the transportation of narcotics and precursors",
    "72_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "72_relevant_article_0_article_text_clauses_0_clause": "",
    "72_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "72_relevant_article_0_article_text_clauses_1_clause": "Agencies, organizations and individuals that have been permitted by competent state agencies may transport narcotics and precursors; When transporting, it must be packaged and sealed according to regulations of the competent authority; Be responsible for quantity and quality, have safety measures to prevent loss during transportation and be subject to monitoring, inspection and supervision by competent state agencies.",
    "72_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "72_relevant_article_0_article_text_clauses_2_clause": "The Government regulates this Article in detail.",
    "73_query_id": "TuesdayBomZhjP",
    "73_label": "Yes",
    "73_query_text": "Demotion is one form of disciplinary action for management officials",
    "73_relevant_article_0_law_id": "Law on Public Employees 2010",
    "73_relevant_article_0_article_id": "52",
    "73_relevant_article_0_article_text_title": "Disciplinary forms for public employees",
    "73_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "73_relevant_article_0_article_text_clauses_0_clause": "",
    "73_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "73_relevant_article_0_article_text_clauses_1_clause": "Officials who violate the provisions of law in the course of performing their work or tasks shall, depending on the nature and severity of the violation, be subject to one of the following disciplinary forms:",
    "73_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Reprimand;",
    "73_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Warning;",
    "73_relevant_article_0_article_text_clauses_1_sub_clauses_2": "Dismiss;",
    "73_relevant_article_0_article_text_clauses_1_sub_clauses_3": "Forced to quit.",
    "73_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "73_relevant_article_0_article_text_clauses_2_clause": "Officials who are disciplined in one of the forms specified in Clause 1 of this Article may also be restricted from performing professional activities according to relevant laws.",
    "73_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "73_relevant_article_0_article_text_clauses_3_clause": "Disciplinary action for dismissal only applies to management officials.",
    "73_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "73_relevant_article_0_article_text_clauses_4_clause": "Disciplinary decisions are recorded in the officer's file.",
    "73_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "73_relevant_article_0_article_text_clauses_5_clause": "The Government regulates the application of disciplinary forms, order, procedures and disciplinary authority for public employees.",
    "74_query_id": "O8JI0xlIS5",
    "74_label": "Yes",
    "74_query_text": "The working contract in case the recruited person is over 18 years old has the following main contents: Name and address of the public service unit and the head of the public service unit, Full name, address, date, month and year of birth of the recruited person.",
    "74_relevant_article_0_law_id": "Law on Public Employees 2010",
    "74_relevant_article_0_article_id": "26",
    "74_relevant_article_0_article_text_title": "Content and form of working contract",
    "74_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "74_relevant_article_0_article_text_clauses_0_clause": "",
    "74_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "74_relevant_article_0_article_text_clauses_1_clause": "The working contract has the following main contents:",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_0": "Name and address of the public service unit and the head of the public service unit;",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_1": "Full name, address, date, month and year of birth of the recruited person.",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_2": "In case the recruited person is under 18 years old, the full name, address, date, month and year of birth of the legal representative of the recruited person must be included;",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_3": "Job or duties, job position and work location;",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_4": "Rights and obligations of the parties;",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_5": "Type of contract, term and termination conditions of the employment contract;",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_6": "Salary, bonus and other benefits (if any);",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_7": "Working time, rest time;",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_8": "Apprenticeship regime (if any);",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_9": "Working conditions and issues related to labor protection;",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_10": "Social insurance, health insurance;",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_11": "Validity of the working contract;",
    "74_relevant_article_0_article_text_clauses_1_sub_clauses_12": "Other commitments are related to the nature, characteristics of the industry, field and specific conditions of the public service unit but are not contrary to the provisions of this Law and other relevant legal provisions.",
    "74_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "74_relevant_article_0_article_text_clauses_2_clause": "The working contract is signed in writing between the head of the public service unit and the person recruited as an employee and is made in three copies, of which one copy is delivered to the employee.",
    "74_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "74_relevant_article_0_article_text_clauses_3_clause": "For professional positions prescribed by law appointed by the superior of the head of a public service unit, the consent of that level must be obtained before signing a working contract.",
    "75_query_id": "Rev8SuR3fn",
    "75_label": "Yes",
    "75_query_text": "What are the rights of teachers? Answer: Taught according to specialized training",
    "75_relevant_article_0_law_id": "Education Law 2019",
    "75_relevant_article_0_article_id": "70",
    "75_relevant_article_0_article_text_title": "Rights of teachers",
    "75_relevant_article_0_article_text_clauses_0_clause_id": "0",
    "75_relevant_article_0_article_text_clauses_0_clause": "",
    "75_relevant_article_0_article_text_clauses_1_clause_id": "1",
    "75_relevant_article_0_article_text_clauses_1_clause": "Taught according to specialized training.",
    "75_relevant_article_0_article_text_clauses_2_clause_id": "2",
    "75_relevant_article_0_article_text_clauses_2_clause": "Trained and fostered to improve political, professional and professional qualifications.",
    "75_relevant_article_0_article_text_clauses_3_clause_id": "3",
    "75_relevant_article_0_article_text_clauses_3_clause": "Receive a contract to guest lecture or do scientific research at another educational institution or scientific research facility.",
    "75_relevant_article_0_article_text_clauses_4_clause_id": "4",
    "75_relevant_article_0_article_text_clauses_4_clause": "Respected and protected dignity, honor and body.",
    "75_relevant_article_0_article_text_clauses_5_clause_id": "5",
    "75_relevant_article_0_article_text_clauses_5_clause": "Have summer vacation according to Government regulations and other holidays as prescribed by law."
}